
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Engine.

/// Struct /Script/Engine.MaterialInput
/// Size: 0x0028 (0x000000 - 0x000028)
struct FMaterialInput
{ 
	UMaterialExpression*                               Expression;                                                 // 0x0000   (0x0008)  
	int32_t                                            OutputIndex;                                                // 0x0008   (0x0004)  
	FName                                              InputName;                                                  // 0x000C   (0x0008)  
	int32_t                                            Mask;                                                       // 0x0014   (0x0004)  
	int32_t                                            MaskR;                                                      // 0x0018   (0x0004)  
	int32_t                                            MaskG;                                                      // 0x001C   (0x0004)  
	int32_t                                            MaskB;                                                      // 0x0020   (0x0004)  
	int32_t                                            MaskA;                                                      // 0x0024   (0x0004)  
};

/// Struct /Script/Engine.ColorMaterialInput
/// Size: 0x0008 (0x000028 - 0x000030)
struct FColorMaterialInput : FMaterialInput
{ 
	bool                                               UseConstant : 1;                                            // 0x0028:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0029   (0x0003)  MISSED
	FColor                                             Constant;                                                   // 0x002C   (0x0004)  
};

/// Struct /Script/Engine.DistributionLookupTable
/// Size: 0x0020 (0x000000 - 0x000020)
struct FDistributionLookupTable
{ 
	float                                              TimeScale;                                                  // 0x0000   (0x0004)  
	float                                              TimeBias;                                                   // 0x0004   (0x0004)  
	TArray<float>                                      Values;                                                     // 0x0008   (0x0010)  
	char                                               Op;                                                         // 0x0018   (0x0001)  
	char                                               EntryCount;                                                 // 0x0019   (0x0001)  
	char                                               EntryStride;                                                // 0x001A   (0x0001)  
	char                                               SubEntryStride;                                             // 0x001B   (0x0001)  
	char                                               LockFlag;                                                   // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x001D   (0x0003)  MISSED
};

/// Struct /Script/Engine.ExpressionInput
/// Size: 0x0028 (0x000000 - 0x000028)
struct FExpressionInput
{ 
	UMaterialExpression*                               Expression;                                                 // 0x0000   (0x0008)  
	int32_t                                            OutputIndex;                                                // 0x0008   (0x0004)  
	FName                                              InputName;                                                  // 0x000C   (0x0008)  
	int32_t                                            Mask;                                                       // 0x0014   (0x0004)  
	int32_t                                            MaskR;                                                      // 0x0018   (0x0004)  
	int32_t                                            MaskG;                                                      // 0x001C   (0x0004)  
	int32_t                                            MaskB;                                                      // 0x0020   (0x0004)  
	int32_t                                            MaskA;                                                      // 0x0024   (0x0004)  
};

/// Struct /Script/Engine.ExpressionOutput
/// Size: 0x001C (0x000000 - 0x00001C)
struct FExpressionOutput
{ 
	FName                                              OutputName;                                                 // 0x0000   (0x0008)  
	int32_t                                            Mask;                                                       // 0x0008   (0x0004)  
	int32_t                                            MaskR;                                                      // 0x000C   (0x0004)  
	int32_t                                            MaskG;                                                      // 0x0010   (0x0004)  
	int32_t                                            MaskB;                                                      // 0x0014   (0x0004)  
	int32_t                                            MaskA;                                                      // 0x0018   (0x0004)  
};

/// Struct /Script/Engine.FloatDistribution
/// Size: 0x0020 (0x000000 - 0x000020)
struct FFloatDistribution
{ 
	FDistributionLookupTable                           Table;                                                      // 0x0000   (0x0020)  
};

/// Struct /Script/Engine.FloatRK4SpringInterpolator
/// Size: 0x0008 (0x000000 - 0x000008)
struct FFloatRK4SpringInterpolator
{ 
	float                                              StiffnessConstant;                                          // 0x0000   (0x0004)  
	float                                              DampeningRatio;                                             // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.FormatArgumentData
/// Size: 0x0050 (0x000000 - 0x000050)
struct FFormatArgumentData
{ 
	FString                                            ArgumentName;                                               // 0x0000   (0x0010)  
	TEnumAsByte<EFormatArgumentType>                   ArgumentValueType;                                          // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0011   (0x0007)  MISSED
	FText                                              ArgumentValue;                                              // 0x0018   (0x0018)  
	int64_t                                            ArgumentValueInt;                                           // 0x0030   (0x0008)  
	float                                              ArgumentValueFloat;                                         // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x003C   (0x0004)  MISSED
	double                                             ArgumentValueDouble;                                        // 0x0040   (0x0008)  
	ETextGender                                        ArgumentValueGender;                                        // 0x0048   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0049   (0x0007)  MISSED
};

/// Struct /Script/Engine.MaterialAttributesInput
/// Size: 0x0008 (0x000028 - 0x000030)
struct FMaterialAttributesInput : FExpressionInput
{ 
	int32_t                                            PropertyConnectedBitmask;                                   // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/Engine.RawDistribution
/// Size: 0x0020 (0x000000 - 0x000020)
struct FRawDistribution
{ 
	FDistributionLookupTable                           Table;                                                      // 0x0000   (0x0020)  
};

/// Struct /Script/Engine.ScalarMaterialInput
/// Size: 0x0008 (0x000028 - 0x000030)
struct FScalarMaterialInput : FMaterialInput
{ 
	bool                                               UseConstant : 1;                                            // 0x0028:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0029   (0x0003)  MISSED
	float                                              Constant;                                                   // 0x002C   (0x0004)  
};

/// Struct /Script/Engine.ShadingModelMaterialInput
/// Size: 0x0000 (0x000028 - 0x000028)
struct FShadingModelMaterialInput : FMaterialInput
{ 
};

/// Struct /Script/Engine.StrataMaterialInput
/// Size: 0x0000 (0x000028 - 0x000028)
struct FStrataMaterialInput : FMaterialInput
{ 
};

/// Struct /Script/Engine.Vector2MaterialInput
/// Size: 0x0010 (0x000028 - 0x000038)
struct FVector2MaterialInput : FMaterialInput
{ 
	bool                                               UseConstant : 1;                                            // 0x0028:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0029   (0x0003)  MISSED
	float                                              ConstantX;                                                  // 0x002C   (0x0004)  
	float                                              ConstantY;                                                  // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/Engine.Vector4Distribution
/// Size: 0x0020 (0x000000 - 0x000020)
struct FVector4Distribution
{ 
	FDistributionLookupTable                           Table;                                                      // 0x0000   (0x0020)  
};

/// Struct /Script/Engine.VectorDistribution
/// Size: 0x0020 (0x000000 - 0x000020)
struct FVectorDistribution
{ 
	FDistributionLookupTable                           Table;                                                      // 0x0000   (0x0020)  
};

/// Struct /Script/Engine.VectorMaterialInput
/// Size: 0x0010 (0x000028 - 0x000038)
struct FVectorMaterialInput : FMaterialInput
{ 
	bool                                               UseConstant : 1;                                            // 0x0028:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0029   (0x0003)  MISSED
	FVector3f                                          Constant;                                                   // 0x002C   (0x000C)  
};

/// Struct /Script/Engine.VectorRK4SpringInterpolator
/// Size: 0x0008 (0x000000 - 0x000008)
struct FVectorRK4SpringInterpolator
{ 
	float                                              StiffnessConstant;                                          // 0x0000   (0x0004)  
	float                                              DampeningRatio;                                             // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.AnimDataModelNotifPayload
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAnimDataModelNotifPayload
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.HitResult
/// Size: 0x00E8 (0x000000 - 0x0000E8)
struct FHitResult
{ 
	int32_t                                            FaceIndex;                                                  // 0x0000   (0x0004)  
	float                                              Time;                                                       // 0x0004   (0x0004)  
	float                                              Distance;                                                   // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	FVector_NetQuantize                                Location;                                                   // 0x0010   (0x0018)  
	FVector_NetQuantize                                ImpactPoint;                                                // 0x0028   (0x0018)  
	FVector_NetQuantizeNormal                          Normal;                                                     // 0x0040   (0x0018)  
	FVector_NetQuantizeNormal                          ImpactNormal;                                               // 0x0058   (0x0018)  
	FVector_NetQuantize                                TraceStart;                                                 // 0x0070   (0x0018)  
	FVector_NetQuantize                                TraceEnd;                                                   // 0x0088   (0x0018)  
	float                                              PenetrationDepth;                                           // 0x00A0   (0x0004)  
	int32_t                                            MyItem;                                                     // 0x00A4   (0x0004)  
	int32_t                                            Item;                                                       // 0x00A8   (0x0004)  
	char                                               ElementIndex;                                               // 0x00AC   (0x0001)  
	bool                                               bBlockingHit : 1;                                           // 0x00AD:0 (0x0001)  
	bool                                               bStartPenetrating : 1;                                      // 0x00AD:1 (0x0001)  
	unsigned char                                      UnknownData01_4[0x2];                                       // 0x00AE   (0x0002)  MISSED
	TWeakObjectPtr<UPhysicalMaterial*>                 PhysMaterial;                                               // 0x00B0   (0x0008)  
	FActorInstanceHandle                               HitObjectHandle;                                            // 0x00B8   (0x0018)  
	TWeakObjectPtr<UPrimitiveComponent*>               Component;                                                  // 0x00D0   (0x0008)  
	FName                                              BoneName;                                                   // 0x00D8   (0x0008)  
	FName                                              MyBoneName;                                                 // 0x00E0   (0x0008)  
};

/// Struct /Script/Engine.ActorInstanceHandle
/// Size: 0x0018 (0x000000 - 0x000018)
struct FActorInstanceHandle
{ 
	TWeakObjectPtr<AActor*>                            Actor;                                                      // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0008   (0x0010)  MISSED
};

/// Struct /Script/Engine.Vector_NetQuantize
/// Size: 0x0000 (0x000018 - 0x000018)
struct FVector_NetQuantize : FVector
{ 
};

/// Struct /Script/Engine.Vector_NetQuantizeNormal
/// Size: 0x0000 (0x000018 - 0x000018)
struct FVector_NetQuantizeNormal : FVector
{ 
};

/// Struct /Script/Engine.SubtitleCue
/// Size: 0x0020 (0x000000 - 0x000020)
struct FSubtitleCue
{ 
	FText                                              Text;                                                       // 0x0000   (0x0018)  
	float                                              Time;                                                       // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/Engine.PlatformInterfaceDelegateResult
/// Size: 0x0038 (0x000000 - 0x000038)
struct FPlatformInterfaceDelegateResult
{ 
	bool                                               bSuccessful;                                                // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	FPlatformInterfaceData                             Data;                                                       // 0x0008   (0x0030)  
};

/// Struct /Script/Engine.PlatformInterfaceData
/// Size: 0x0030 (0x000000 - 0x000030)
struct FPlatformInterfaceData
{ 
	FName                                              DataName;                                                   // 0x0000   (0x0008)  
	TEnumAsByte<EPlatformInterfaceDataType>            Type;                                                       // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            IntValue;                                                   // 0x000C   (0x0004)  
	float                                              FloatValue;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            StringValue;                                                // 0x0018   (0x0010)  
	UObject*                                           ObjectValue;                                                // 0x0028   (0x0008)  
};

/// Struct /Script/Engine.BranchingPointNotifyPayload
/// Size: 0x0020 (0x000000 - 0x000020)
struct FBranchingPointNotifyPayload
{ 
	unsigned char                                      UnknownData00_1[0x20];                                      // 0x0000   (0x0020)  MISSED
};

/// Struct /Script/Engine.TickFunction
/// Size: 0x0028 (0x000000 - 0x000028)
struct FTickFunction
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	TEnumAsByte<ETickingGroup>                         TickGroup;                                                  // 0x0008   (0x0001)  
	TEnumAsByte<ETickingGroup>                         EndTickGroup;                                               // 0x0009   (0x0001)  
	bool                                               bTickEvenWhenPaused : 1;                                    // 0x000A:0 (0x0001)  
	bool                                               bCanEverTick : 1;                                           // 0x000A:1 (0x0001)  
	bool                                               bStartWithTickEnabled : 1;                                  // 0x000A:2 (0x0001)  
	bool                                               bAllowTickOnDedicatedServer : 1;                            // 0x000A:3 (0x0001)  
	unsigned char                                      UnknownData01_4[0x1];                                       // 0x000B   (0x0001)  MISSED
	float                                              TickInterval;                                               // 0x000C   (0x0004)  
	unsigned char                                      UnknownData02_6[0x18];                                      // 0x0010   (0x0018)  MISSED
};

/// Struct /Script/Engine.ActorComponentTickFunction
/// Size: 0x0008 (0x000028 - 0x000030)
struct FActorComponentTickFunction : FTickFunction
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Struct /Script/Engine.InterpControlPoint
/// Size: 0x0028 (0x000000 - 0x000028)
struct FInterpControlPoint
{ 
	FVector                                            PositionControlPoint;                                       // 0x0000   (0x0018)  
	bool                                               bPositionIsRelative;                                        // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_6[0xF];                                       // 0x0019   (0x000F)  MISSED
};

/// Struct /Script/Engine.DebugFloatHistory
/// Size: 0x0020 (0x000000 - 0x000020)
struct FDebugFloatHistory
{ 
	TArray<float>                                      Samples;                                                    // 0x0000   (0x0010)  
	int32_t                                            MaxSamples;                                                 // 0x0010   (0x0004)  
	float                                              MinValue;                                                   // 0x0014   (0x0004)  
	float                                              MaxValue;                                                   // 0x0018   (0x0004)  
	bool                                               bAutoAdjustMinMax;                                          // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x001D   (0x0003)  MISSED
};

/// Struct /Script/Engine.LatentActionInfo
/// Size: 0x0018 (0x000000 - 0x000018)
struct FLatentActionInfo
{ 
	int32_t                                            Linkage;                                                    // 0x0000   (0x0004)  
	int32_t                                            UUID;                                                       // 0x0004   (0x0004)  
	FName                                              ExecutionFunction;                                          // 0x0008   (0x0008)  
	UObject*                                           CallbackTarget;                                             // 0x0010   (0x0008)  
};

/// Struct /Script/Engine.TimerHandle
/// Size: 0x0008 (0x000000 - 0x000008)
struct FTimerHandle
{ 
	uint64_t                                           Handle;                                                     // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.CollisionProfileName
/// Size: 0x0008 (0x000000 - 0x000008)
struct FCollisionProfileName
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.GenericStruct
/// Size: 0x0004 (0x000000 - 0x000004)
struct FGenericStruct
{ 
	int32_t                                            Data;                                                       // 0x0000   (0x0004)  
};

/// Struct /Script/Engine.UserActivity
/// Size: 0x0018 (0x000000 - 0x000018)
struct FUserActivity
{ 
	FString                                            ActionName;                                                 // 0x0000   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0010   (0x0008)  MISSED
};

/// Struct /Script/Engine.CurveTableRowHandle
/// Size: 0x0010 (0x000000 - 0x000010)
struct FCurveTableRowHandle
{ 
	UCurveTable*                                       CurveTable;                                                 // 0x0000   (0x0008)  
	FName                                              RowName;                                                    // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.Vector_NetQuantize10
/// Size: 0x0000 (0x000018 - 0x000018)
struct FVector_NetQuantize10 : FVector
{ 
};

/// Struct /Script/Engine.Vector_NetQuantize100
/// Size: 0x0000 (0x000018 - 0x000018)
struct FVector_NetQuantize100 : FVector
{ 
};

/// Struct /Script/Engine.DataTableRowHandle
/// Size: 0x0010 (0x000000 - 0x000010)
struct FDataTableRowHandle
{ 
	UDataTable*                                        DataTable;                                                  // 0x0000   (0x0008)  
	FName                                              RowName;                                                    // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.BodyInstanceAsyncPhysicsTickHandle
/// Size: 0x0008 (0x000000 - 0x000008)
struct FBodyInstanceAsyncPhysicsTickHandle
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/Engine.WalkableSlopeOverride
/// Size: 0x0010 (0x000000 - 0x000010)
struct FWalkableSlopeOverride
{ 
	TEnumAsByte<EWalkableSlopeBehavior>                WalkableSlopeBehavior;                                      // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              WalkableSlopeAngle;                                         // 0x0004   (0x0004)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0008   (0x0008)  MISSED
};

/// Struct /Script/Engine.BodyInstance
/// Size: 0x0178 (0x000018 - 0x000190)
struct FBodyInstance : FBodyInstanceCore
{ 
	unsigned char                                      UnknownData00_2[0x6];                                       // 0x0018   (0x0006)  MISSED
	TEnumAsByte<ECollisionChannel>                     ObjectType;                                                 // 0x001E   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x001F   (0x0001)  MISSED
	TEnumAsByte<ECollisionEnabled>                     CollisionEnabled;                                           // 0x0020   (0x0001)  
	unsigned char                                      UnknownData02_5[0x38];                                      // 0x0021   (0x0038)  MISSED
	ESleepFamily                                       SleepFamily;                                                // 0x0059   (0x0001)  
	TEnumAsByte<EDOFMode>                              DOFMode;                                                    // 0x005A   (0x0001)  
	bool                                               bUseCCD : 1;                                                // 0x005B:0 (0x0001)  
	bool                                               bIgnoreAnalyticCollisions : 1;                              // 0x005B:1 (0x0001)  
	bool                                               bNotifyRigidBodyCollision : 1;                              // 0x005B:2 (0x0001)  
	unsigned char                                      UnknownBit03 : 1;                                           // 0x005B:3 (0x0001)  MISSED
	bool                                               bSmoothEdgeCollisions : 1;                                  // 0x005B:4 (0x0001)  
	bool                                               bLockTranslation : 1;                                       // 0x005B:5 (0x0001)  
	bool                                               bLockRotation : 1;                                          // 0x005B:6 (0x0001)  
	bool                                               bLockXTranslation : 1;                                      // 0x005B:7 (0x0001)  
	bool                                               bLockYTranslation : 1;                                      // 0x005C:0 (0x0001)  
	bool                                               bLockZTranslation : 1;                                      // 0x005C:1 (0x0001)  
	bool                                               bLockXRotation : 1;                                         // 0x005C:2 (0x0001)  
	bool                                               bLockYRotation : 1;                                         // 0x005C:3 (0x0001)  
	bool                                               bLockZRotation : 1;                                         // 0x005C:4 (0x0001)  
	bool                                               bOverrideMaxAngularVelocity : 1;                            // 0x005C:5 (0x0001)  
	unsigned char                                      UnknownBit04 : 1;                                           // 0x005C:6 (0x0001)  MISSED
	unsigned char                                      UnknownBit05 : 1;                                           // 0x005C:7 (0x0001)  MISSED
	bool                                               bOverrideMaxDepenetrationVelocity : 1;                      // 0x005D:0 (0x0001)  
	bool                                               bOverrideWalkableSlopeOnInstance : 1;                       // 0x005D:1 (0x0001)  
	bool                                               bInterpolateWhenSubStepping : 1;                            // 0x005D:2 (0x0001)  
	unsigned char                                      UnknownBit06 : 1;                                           // 0x005D:3 (0x0001)  MISSED
	bool                                               bInertiaConditioning : 1;                                   // 0x005D:4 (0x0001)  
	unsigned char                                      UnknownData07_4[0x1A];                                      // 0x005E   (0x001A)  MISSED
	FName                                              CollisionProfileName;                                       // 0x0078   (0x0008)  
	char                                               PositionSolverIterationCount;                               // 0x0080   (0x0001)  
	char                                               VelocitySolverIterationCount;                               // 0x0081   (0x0001)  
	unsigned char                                      UnknownData08_5[0x6];                                       // 0x0082   (0x0006)  MISSED
	FCollisionResponse                                 CollisionResponses;                                         // 0x0088   (0x0030)  
	float                                              MaxDepenetrationVelocity;                                   // 0x00B8   (0x0004)  
	float                                              MassInKgOverride;                                           // 0x00BC   (0x0004)  
	unsigned char                                      UnknownData09_5[0x8];                                       // 0x00C0   (0x0008)  MISSED
	float                                              LinearDamping;                                              // 0x00C8   (0x0004)  
	float                                              AngularDamping;                                             // 0x00CC   (0x0004)  
	FVector                                            CustomDOFPlaneNormal;                                       // 0x00D0   (0x0018)  
	FVector                                            COMNudge;                                                   // 0x00E8   (0x0018)  
	float                                              MassScale;                                                  // 0x0100   (0x0004)  
	unsigned char                                      UnknownData10_5[0x4];                                       // 0x0104   (0x0004)  MISSED
	FVector                                            InertiaTensorScale;                                         // 0x0108   (0x0018)  
	unsigned char                                      UnknownData11_5[0x10];                                      // 0x0120   (0x0010)  MISSED
	FWalkableSlopeOverride                             WalkableSlopeOverride;                                      // 0x0130   (0x0010)  
	UPhysicalMaterial*                                 PhysMaterialOverride;                                       // 0x0140   (0x0008)  
	float                                              MaxAngularVelocity;                                         // 0x0148   (0x0004)  
	float                                              CustomSleepThresholdMultiplier;                             // 0x014C   (0x0004)  
	float                                              StabilizationThresholdMultiplier;                           // 0x0150   (0x0004)  
	float                                              PhysicsBlendWeight;                                         // 0x0154   (0x0004)  
	unsigned char                                      UnknownData12_6[0x38];                                      // 0x0158   (0x0038)  MISSED
};

/// Struct /Script/Engine.CollisionResponse
/// Size: 0x0030 (0x000000 - 0x000030)
struct FCollisionResponse
{ 
	FCollisionResponseContainer                        ResponseToChannels;                                         // 0x0000   (0x0020)  
	TArray<FResponseChannel>                           ResponseArray;                                              // 0x0020   (0x0010)  
};

/// Struct /Script/Engine.ResponseChannel
/// Size: 0x000C (0x000000 - 0x00000C)
struct FResponseChannel
{ 
	FName                                              Channel;                                                    // 0x0000   (0x0008)  
	TEnumAsByte<ECollisionResponse>                    Response;                                                   // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
};

/// Struct /Script/Engine.CollisionResponseContainer
/// Size: 0x0020 (0x000000 - 0x000020)
struct FCollisionResponseContainer
{ 
	TEnumAsByte<ECollisionResponse>                    WorldStatic;                                                // 0x0000   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    WorldDynamic;                                               // 0x0001   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    Pawn;                                                       // 0x0002   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    Visibility;                                                 // 0x0003   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    Camera;                                                     // 0x0004   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    PhysicsBody;                                                // 0x0005   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    Vehicle;                                                    // 0x0006   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    Destructible;                                               // 0x0007   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    EngineTraceChannel1;                                        // 0x0008   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    EngineTraceChannel2;                                        // 0x0009   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    EngineTraceChannel3;                                        // 0x000A   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    EngineTraceChannel4;                                        // 0x000B   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    EngineTraceChannel5;                                        // 0x000C   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    EngineTraceChannel6;                                        // 0x000D   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel1;                                          // 0x000E   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel2;                                          // 0x000F   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel3;                                          // 0x0010   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel4;                                          // 0x0011   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel5;                                          // 0x0012   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel6;                                          // 0x0013   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel7;                                          // 0x0014   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel8;                                          // 0x0015   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel9;                                          // 0x0016   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel10;                                         // 0x0017   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel11;                                         // 0x0018   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel12;                                         // 0x0019   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel13;                                         // 0x001A   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel14;                                         // 0x001B   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel15;                                         // 0x001C   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel16;                                         // 0x001D   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel17;                                         // 0x001E   (0x0001)  
	TEnumAsByte<ECollisionResponse>                    GameTraceChannel18;                                         // 0x001F   (0x0001)  
};

/// Struct /Script/Engine.CustomPrimitiveData
/// Size: 0x0010 (0x000000 - 0x000010)
struct FCustomPrimitiveData
{ 
	TArray<float>                                      Data;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.LightingChannels
/// Size: 0x0001 (0x000000 - 0x000001)
struct FLightingChannels
{ 
	bool                                               bChannel0 : 1;                                              // 0x0000:0 (0x0001)  
	bool                                               bChannel1 : 1;                                              // 0x0000:1 (0x0001)  
	bool                                               bChannel2 : 1;                                              // 0x0000:2 (0x0001)  
};

/// Struct /Script/Engine.TableRowBase
/// Size: 0x0008 (0x000000 - 0x000008)
struct FTableRowBase
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/Engine.KeyHandleLookupTable
/// Size: 0x0088 (0x000000 - 0x000088)
struct FKeyHandleLookupTable
{ 
	unsigned char                                      UnknownData00_1[0x88];                                      // 0x0000   (0x0088)  MISSED
};

/// Struct /Script/Engine.PostProcessSettings
/// Size: 0x06E0 (0x000000 - 0x0006E0)
struct FPostProcessSettings
{ 
	bool                                               bOverride_TemperatureType : 1;                              // 0x0000:0 (0x0001)  
	bool                                               bOverride_WhiteTemp : 1;                                    // 0x0000:1 (0x0001)  
	bool                                               bOverride_WhiteTint : 1;                                    // 0x0000:2 (0x0001)  
	bool                                               bOverride_ColorSaturation : 1;                              // 0x0000:3 (0x0001)  
	bool                                               bOverride_ColorContrast : 1;                                // 0x0000:4 (0x0001)  
	bool                                               bOverride_ColorGamma : 1;                                   // 0x0000:5 (0x0001)  
	bool                                               bOverride_ColorGain : 1;                                    // 0x0000:6 (0x0001)  
	bool                                               bOverride_ColorOffset : 1;                                  // 0x0000:7 (0x0001)  
	bool                                               bOverride_ColorSaturationShadows : 1;                       // 0x0001:0 (0x0001)  
	bool                                               bOverride_ColorContrastShadows : 1;                         // 0x0001:1 (0x0001)  
	bool                                               bOverride_ColorGammaShadows : 1;                            // 0x0001:2 (0x0001)  
	bool                                               bOverride_ColorGainShadows : 1;                             // 0x0001:3 (0x0001)  
	bool                                               bOverride_ColorOffsetShadows : 1;                           // 0x0001:4 (0x0001)  
	bool                                               bOverride_ColorSaturationMidtones : 1;                      // 0x0001:5 (0x0001)  
	bool                                               bOverride_ColorContrastMidtones : 1;                        // 0x0001:6 (0x0001)  
	bool                                               bOverride_ColorGammaMidtones : 1;                           // 0x0001:7 (0x0001)  
	bool                                               bOverride_ColorGainMidtones : 1;                            // 0x0002:0 (0x0001)  
	bool                                               bOverride_ColorOffsetMidtones : 1;                          // 0x0002:1 (0x0001)  
	bool                                               bOverride_ColorSaturationHighlights : 1;                    // 0x0002:2 (0x0001)  
	bool                                               bOverride_ColorContrastHighlights : 1;                      // 0x0002:3 (0x0001)  
	bool                                               bOverride_ColorGammaHighlights : 1;                         // 0x0002:4 (0x0001)  
	bool                                               bOverride_ColorGainHighlights : 1;                          // 0x0002:5 (0x0001)  
	bool                                               bOverride_ColorOffsetHighlights : 1;                        // 0x0002:6 (0x0001)  
	bool                                               bOverride_ColorCorrectionShadowsMax : 1;                    // 0x0002:7 (0x0001)  
	bool                                               bOverride_ColorCorrectionHighlightsMin : 1;                 // 0x0003:0 (0x0001)  
	bool                                               bOverride_ColorCorrectionHighlightsMax : 1;                 // 0x0003:1 (0x0001)  
	bool                                               bOverride_BlueCorrection : 1;                               // 0x0003:2 (0x0001)  
	bool                                               bOverride_ExpandGamut : 1;                                  // 0x0003:3 (0x0001)  
	bool                                               bOverride_ToneCurveAmount : 1;                              // 0x0003:4 (0x0001)  
	bool                                               bOverride_FilmSlope : 1;                                    // 0x0003:5 (0x0001)  
	bool                                               bOverride_FilmToe : 1;                                      // 0x0003:6 (0x0001)  
	bool                                               bOverride_FilmShoulder : 1;                                 // 0x0003:7 (0x0001)  
	bool                                               bOverride_FilmBlackClip : 1;                                // 0x0004:0 (0x0001)  
	bool                                               bOverride_FilmWhiteClip : 1;                                // 0x0004:1 (0x0001)  
	bool                                               bOverride_SceneColorTint : 1;                               // 0x0004:2 (0x0001)  
	bool                                               bOverride_SceneFringeIntensity : 1;                         // 0x0004:3 (0x0001)  
	bool                                               bOverride_ChromaticAberrationStartOffset : 1;               // 0x0004:4 (0x0001)  
	bool                                               bOverride_AmbientCubemapTint : 1;                           // 0x0004:5 (0x0001)  
	bool                                               bOverride_AmbientCubemapIntensity : 1;                      // 0x0004:6 (0x0001)  
	bool                                               bOverride_BloomMethod : 1;                                  // 0x0004:7 (0x0001)  
	bool                                               bOverride_BloomIntensity : 1;                               // 0x0005:0 (0x0001)  
	bool                                               bOverride_BloomThreshold : 1;                               // 0x0005:1 (0x0001)  
	bool                                               bOverride_Bloom1Tint : 1;                                   // 0x0005:2 (0x0001)  
	bool                                               bOverride_Bloom1Size : 1;                                   // 0x0005:3 (0x0001)  
	bool                                               bOverride_Bloom2Size : 1;                                   // 0x0005:4 (0x0001)  
	bool                                               bOverride_Bloom2Tint : 1;                                   // 0x0005:5 (0x0001)  
	bool                                               bOverride_Bloom3Tint : 1;                                   // 0x0005:6 (0x0001)  
	bool                                               bOverride_Bloom3Size : 1;                                   // 0x0005:7 (0x0001)  
	bool                                               bOverride_Bloom4Tint : 1;                                   // 0x0006:0 (0x0001)  
	bool                                               bOverride_Bloom4Size : 1;                                   // 0x0006:1 (0x0001)  
	bool                                               bOverride_Bloom5Tint : 1;                                   // 0x0006:2 (0x0001)  
	bool                                               bOverride_Bloom5Size : 1;                                   // 0x0006:3 (0x0001)  
	bool                                               bOverride_Bloom6Tint : 1;                                   // 0x0006:4 (0x0001)  
	bool                                               bOverride_Bloom6Size : 1;                                   // 0x0006:5 (0x0001)  
	bool                                               bOverride_BloomSizeScale : 1;                               // 0x0006:6 (0x0001)  
	bool                                               bOverride_BloomConvolutionTexture : 1;                      // 0x0006:7 (0x0001)  
	bool                                               bOverride_BloomConvolutionScatterDispersion : 1;            // 0x0007:0 (0x0001)  
	bool                                               bOverride_BloomConvolutionSize : 1;                         // 0x0007:1 (0x0001)  
	bool                                               bOverride_BloomConvolutionCenterUV : 1;                     // 0x0007:2 (0x0001)  
	bool                                               bOverride_BloomConvolutionPreFilter : 1;                    // 0x0007:3 (0x0001)  
	bool                                               bOverride_BloomConvolutionPreFilterMin : 1;                 // 0x0007:4 (0x0001)  
	bool                                               bOverride_BloomConvolutionPreFilterMax : 1;                 // 0x0007:5 (0x0001)  
	bool                                               bOverride_BloomConvolutionPreFilterMult : 1;                // 0x0007:6 (0x0001)  
	bool                                               bOverride_BloomConvolutionBufferScale : 1;                  // 0x0007:7 (0x0001)  
	bool                                               bOverride_BloomDirtMaskIntensity : 1;                       // 0x0008:0 (0x0001)  
	bool                                               bOverride_BloomDirtMaskTint : 1;                            // 0x0008:1 (0x0001)  
	bool                                               bOverride_BloomDirtMask : 1;                                // 0x0008:2 (0x0001)  
	bool                                               bOverride_CameraShutterSpeed : 1;                           // 0x0008:3 (0x0001)  
	bool                                               bOverride_CameraISO : 1;                                    // 0x0008:4 (0x0001)  
	bool                                               bOverride_AutoExposureMethod : 1;                           // 0x0008:5 (0x0001)  
	bool                                               bOverride_AutoExposureLowPercent : 1;                       // 0x0008:6 (0x0001)  
	bool                                               bOverride_AutoExposureHighPercent : 1;                      // 0x0008:7 (0x0001)  
	bool                                               bOverride_AutoExposureMinBrightness : 1;                    // 0x0009:0 (0x0001)  
	bool                                               bOverride_AutoExposureMaxBrightness : 1;                    // 0x0009:1 (0x0001)  
	bool                                               bOverride_AutoExposureCalibrationConstant : 1;              // 0x0009:2 (0x0001)  
	bool                                               bOverride_AutoExposureSpeedUp : 1;                          // 0x0009:3 (0x0001)  
	bool                                               bOverride_AutoExposureSpeedDown : 1;                        // 0x0009:4 (0x0001)  
	bool                                               bOverride_AutoExposureBias : 1;                             // 0x0009:5 (0x0001)  
	bool                                               bOverride_AutoExposureBiasCurve : 1;                        // 0x0009:6 (0x0001)  
	bool                                               bOverride_AutoExposureMeterMask : 1;                        // 0x0009:7 (0x0001)  
	bool                                               bOverride_AutoExposureApplyPhysicalCameraExposure : 1;      // 0x000A:0 (0x0001)  
	bool                                               bOverride_HistogramLogMin : 1;                              // 0x000A:1 (0x0001)  
	bool                                               bOverride_HistogramLogMax : 1;                              // 0x000A:2 (0x0001)  
	bool                                               bOverride_LocalExposureContrastScale : 1;                   // 0x000A:3 (0x0001)  
	bool                                               bOverride_LocalExposureHighlightContrastScale : 1;          // 0x000A:4 (0x0001)  
	bool                                               bOverride_LocalExposureShadowContrastScale : 1;             // 0x000A:5 (0x0001)  
	bool                                               bOverride_LocalExposureDetailStrength : 1;                  // 0x000A:6 (0x0001)  
	bool                                               bOverride_LocalExposureBlurredLuminanceBlend : 1;           // 0x000A:7 (0x0001)  
	bool                                               bOverride_LocalExposureBlurredLuminanceKernelSizePercent : 1; // 0x000B:0 (0x0001)  
	bool                                               bOverride_LocalExposureMiddleGreyBias : 1;                  // 0x000B:1 (0x0001)  
	bool                                               bOverride_LensFlareIntensity : 1;                           // 0x000B:2 (0x0001)  
	bool                                               bOverride_LensFlareTint : 1;                                // 0x000B:3 (0x0001)  
	bool                                               bOverride_LensFlareTints : 1;                               // 0x000B:4 (0x0001)  
	bool                                               bOverride_LensFlareBokehSize : 1;                           // 0x000B:5 (0x0001)  
	bool                                               bOverride_LensFlareBokehShape : 1;                          // 0x000B:6 (0x0001)  
	bool                                               bOverride_LensFlareThreshold : 1;                           // 0x000B:7 (0x0001)  
	bool                                               bOverride_VignetteIntensity : 1;                            // 0x000C:0 (0x0001)  
	bool                                               bOverride_GrainIntensity : 1;                               // 0x000C:1 (0x0001)  
	bool                                               bOverride_GrainJitter : 1;                                  // 0x000C:2 (0x0001)  
	bool                                               bOverride_FilmGrainIntensity : 1;                           // 0x000C:3 (0x0001)  
	bool                                               bOverride_FilmGrainIntensityShadows : 1;                    // 0x000C:4 (0x0001)  
	bool                                               bOverride_FilmGrainIntensityMidtones : 1;                   // 0x000C:5 (0x0001)  
	bool                                               bOverride_FilmGrainIntensityHighlights : 1;                 // 0x000C:6 (0x0001)  
	bool                                               bOverride_FilmGrainShadowsMax : 1;                          // 0x000C:7 (0x0001)  
	bool                                               bOverride_FilmGrainHighlightsMin : 1;                       // 0x000D:0 (0x0001)  
	bool                                               bOverride_FilmGrainHighlightsMax : 1;                       // 0x000D:1 (0x0001)  
	bool                                               bOverride_FilmGrainTexelSize : 1;                           // 0x000D:2 (0x0001)  
	bool                                               bOverride_FilmGrainTexture : 1;                             // 0x000D:3 (0x0001)  
	bool                                               bOverride_AmbientOcclusionIntensity : 1;                    // 0x000D:4 (0x0001)  
	bool                                               bOverride_AmbientOcclusionStaticFraction : 1;               // 0x000D:5 (0x0001)  
	bool                                               bOverride_AmbientOcclusionRadius : 1;                       // 0x000D:6 (0x0001)  
	bool                                               bOverride_AmbientOcclusionFadeDistance : 1;                 // 0x000D:7 (0x0001)  
	bool                                               bOverride_AmbientOcclusionFadeRadius : 1;                   // 0x000E:0 (0x0001)  
	bool                                               bOverride_AmbientOcclusionDistance : 1;                     // 0x000E:1 (0x0001)  
	bool                                               bOverride_AmbientOcclusionRadiusInWS : 1;                   // 0x000E:2 (0x0001)  
	bool                                               bOverride_AmbientOcclusionPower : 1;                        // 0x000E:3 (0x0001)  
	bool                                               bOverride_AmbientOcclusionBias : 1;                         // 0x000E:4 (0x0001)  
	bool                                               bOverride_AmbientOcclusionQuality : 1;                      // 0x000E:5 (0x0001)  
	bool                                               bOverride_AmbientOcclusionMipBlend : 1;                     // 0x000E:6 (0x0001)  
	bool                                               bOverride_AmbientOcclusionMipScale : 1;                     // 0x000E:7 (0x0001)  
	bool                                               bOverride_AmbientOcclusionMipThreshold : 1;                 // 0x000F:0 (0x0001)  
	bool                                               bOverride_AmbientOcclusionTemporalBlendWeight : 1;          // 0x000F:1 (0x0001)  
	unsigned char                                      UnknownBit00 : 1;                                           // 0x000F:2 (0x0001)  MISSED
	unsigned char                                      UnknownBit01 : 1;                                           // 0x000F:3 (0x0001)  MISSED
	unsigned char                                      UnknownBit02 : 1;                                           // 0x000F:4 (0x0001)  MISSED
	unsigned char                                      UnknownBit03 : 1;                                           // 0x000F:5 (0x0001)  MISSED
	unsigned char                                      UnknownBit04 : 1;                                           // 0x000F:6 (0x0001)  MISSED
	unsigned char                                      UnknownBit05 : 1;                                           // 0x000F:7 (0x0001)  MISSED
	bool                                               bOverride_RayTracingAO : 1;                                 // 0x0010:0 (0x0001)  
	bool                                               bOverride_RayTracingAOSamplesPerPixel : 1;                  // 0x0010:1 (0x0001)  
	bool                                               bOverride_RayTracingAOIntensity : 1;                        // 0x0010:2 (0x0001)  
	bool                                               bOverride_RayTracingAORadius : 1;                           // 0x0010:3 (0x0001)  
	unsigned char                                      UnknownData06_3[0x3];                                       // 0x0011   (0x0003)  MISSED
	bool                                               bOverride_LPVIntensity : 1;                                 // 0x0014:0 (0x0001)  
	bool                                               bOverride_LPVDirectionalOcclusionIntensity : 1;             // 0x0014:1 (0x0001)  
	bool                                               bOverride_LPVDirectionalOcclusionRadius : 1;                // 0x0014:2 (0x0001)  
	bool                                               bOverride_LPVDiffuseOcclusionExponent : 1;                  // 0x0014:3 (0x0001)  
	bool                                               bOverride_LPVSpecularOcclusionExponent : 1;                 // 0x0014:4 (0x0001)  
	bool                                               bOverride_LPVDiffuseOcclusionIntensity : 1;                 // 0x0014:5 (0x0001)  
	bool                                               bOverride_LPVSpecularOcclusionIntensity : 1;                // 0x0014:6 (0x0001)  
	bool                                               bOverride_LPVSize : 1;                                      // 0x0014:7 (0x0001)  
	bool                                               bOverride_LPVSecondaryOcclusionIntensity : 1;               // 0x0015:0 (0x0001)  
	bool                                               bOverride_LPVSecondaryBounceIntensity : 1;                  // 0x0015:1 (0x0001)  
	bool                                               bOverride_LPVGeometryVolumeBias : 1;                        // 0x0015:2 (0x0001)  
	bool                                               bOverride_LPVVplInjectionBias : 1;                          // 0x0015:3 (0x0001)  
	bool                                               bOverride_LPVEmissiveInjectionIntensity : 1;                // 0x0015:4 (0x0001)  
	bool                                               bOverride_LPVFadeRange : 1;                                 // 0x0015:5 (0x0001)  
	bool                                               bOverride_LPVDirectionalOcclusionFadeRange : 1;             // 0x0015:6 (0x0001)  
	bool                                               bOverride_IndirectLightingColor : 1;                        // 0x0015:7 (0x0001)  
	bool                                               bOverride_IndirectLightingIntensity : 1;                    // 0x0016:0 (0x0001)  
	bool                                               bOverride_ColorGradingIntensity : 1;                        // 0x0016:1 (0x0001)  
	bool                                               bOverride_ColorGradingLUT : 1;                              // 0x0016:2 (0x0001)  
	bool                                               bOverride_DepthOfFieldFocalDistance : 1;                    // 0x0016:3 (0x0001)  
	bool                                               bOverride_DepthOfFieldFstop : 1;                            // 0x0016:4 (0x0001)  
	bool                                               bOverride_DepthOfFieldMinFstop : 1;                         // 0x0016:5 (0x0001)  
	bool                                               bOverride_DepthOfFieldBladeCount : 1;                       // 0x0016:6 (0x0001)  
	bool                                               bOverride_DepthOfFieldSensorWidth : 1;                      // 0x0016:7 (0x0001)  
	bool                                               bOverride_DepthOfFieldSqueezeFactor : 1;                    // 0x0017:0 (0x0001)  
	bool                                               bOverride_DepthOfFieldDepthBlurRadius : 1;                  // 0x0017:1 (0x0001)  
	bool                                               bOverride_DepthOfFieldDepthBlurAmount : 1;                  // 0x0017:2 (0x0001)  
	bool                                               bOverride_DepthOfFieldFocalRegion : 1;                      // 0x0017:3 (0x0001)  
	bool                                               bOverride_DepthOfFieldNearTransitionRegion : 1;             // 0x0017:4 (0x0001)  
	bool                                               bOverride_DepthOfFieldFarTransitionRegion : 1;              // 0x0017:5 (0x0001)  
	bool                                               bOverride_DepthOfFieldScale : 1;                            // 0x0017:6 (0x0001)  
	bool                                               bOverride_DepthOfFieldNearBlurSize : 1;                     // 0x0017:7 (0x0001)  
	bool                                               bOverride_DepthOfFieldFarBlurSize : 1;                      // 0x0018:0 (0x0001)  
	bool                                               bOverride_MobileHQGaussian : 1;                             // 0x0018:1 (0x0001)  
	bool                                               bOverride_DepthOfFieldOcclusion : 1;                        // 0x0018:2 (0x0001)  
	bool                                               bOverride_DepthOfFieldSkyFocusDistance : 1;                 // 0x0018:3 (0x0001)  
	bool                                               bOverride_DepthOfFieldVignetteSize : 1;                     // 0x0018:4 (0x0001)  
	bool                                               bOverride_MotionBlurAmount : 1;                             // 0x0018:5 (0x0001)  
	bool                                               bOverride_MotionBlurMax : 1;                                // 0x0018:6 (0x0001)  
	bool                                               bOverride_MotionBlurTargetFPS : 1;                          // 0x0018:7 (0x0001)  
	bool                                               bOverride_MotionBlurPerObjectSize : 1;                      // 0x0019:0 (0x0001)  
	bool                                               bOverride_ScreenPercentage : 1;                             // 0x0019:1 (0x0001)  
	bool                                               bOverride_ReflectionMethod : 1;                             // 0x0019:2 (0x0001)  
	bool                                               bOverride_LumenReflectionQuality : 1;                       // 0x0019:3 (0x0001)  
	bool                                               bOverride_ScreenSpaceReflectionIntensity : 1;               // 0x0019:4 (0x0001)  
	bool                                               bOverride_ScreenSpaceReflectionQuality : 1;                 // 0x0019:5 (0x0001)  
	bool                                               bOverride_ScreenSpaceReflectionMaxRoughness : 1;            // 0x0019:6 (0x0001)  
	bool                                               bOverride_ScreenSpaceReflectionRoughnessScale : 1;          // 0x0019:7 (0x0001)  
	unsigned char                                      UnknownData07_3[0x1];                                       // 0x001B   (0x0001)  MISSED
	bool                                               bOverride_ReflectionsType : 1;                              // 0x001C:0 (0x0001)  
	bool                                               bOverride_RayTracingReflectionsMaxRoughness : 1;            // 0x001C:1 (0x0001)  
	bool                                               bOverride_RayTracingReflectionsMaxBounces : 1;              // 0x001C:2 (0x0001)  
	bool                                               bOverride_RayTracingReflectionsSamplesPerPixel : 1;         // 0x001C:3 (0x0001)  
	bool                                               bOverride_RayTracingReflectionsShadows : 1;                 // 0x001C:4 (0x0001)  
	bool                                               bOverride_RayTracingReflectionsTranslucency : 1;            // 0x001C:5 (0x0001)  
	bool                                               bOverride_TranslucencyType : 1;                             // 0x001C:6 (0x0001)  
	bool                                               bOverride_RayTracingTranslucencyMaxRoughness : 1;           // 0x001C:7 (0x0001)  
	bool                                               bOverride_RayTracingTranslucencyRefractionRays : 1;         // 0x001D:0 (0x0001)  
	bool                                               bOverride_RayTracingTranslucencySamplesPerPixel : 1;        // 0x001D:1 (0x0001)  
	bool                                               bOverride_RayTracingTranslucencyShadows : 1;                // 0x001D:2 (0x0001)  
	bool                                               bOverride_RayTracingTranslucencyRefraction : 1;             // 0x001D:3 (0x0001)  
	bool                                               bOverride_DynamicGlobalIlluminationMethod : 1;              // 0x001D:4 (0x0001)  
	bool                                               bOverride_LumenSceneLightingQuality : 1;                    // 0x001D:5 (0x0001)  
	bool                                               bOverride_LumenSceneDetail : 1;                             // 0x001D:6 (0x0001)  
	bool                                               bOverride_LumenSceneViewDistance : 1;                       // 0x001D:7 (0x0001)  
	bool                                               bOverride_LumenSceneLightingUpdateSpeed : 1;                // 0x001E:0 (0x0001)  
	bool                                               bOverride_LumenFinalGatherQuality : 1;                      // 0x001E:1 (0x0001)  
	bool                                               bOverride_LumenFinalGatherLightingUpdateSpeed : 1;          // 0x001E:2 (0x0001)  
	bool                                               bOverride_LumenMaxTraceDistance : 1;                        // 0x001E:3 (0x0001)  
	bool                                               bOverride_LumenDiffuseColorBoost : 1;                       // 0x001E:4 (0x0001)  
	bool                                               bOverride_LumenSkylightLeaking : 1;                         // 0x001E:5 (0x0001)  
	bool                                               bOverride_LumenFullSkylightLeakingDistance : 1;             // 0x001E:6 (0x0001)  
	unsigned char                                      UnknownData08_3[0x1];                                       // 0x001F   (0x0001)  MISSED
	bool                                               bOverride_LumenRayLightingMode : 1;                         // 0x0020:0 (0x0001)  
	bool                                               bOverride_LumenFrontLayerTranslucencyReflections : 1;       // 0x0020:1 (0x0001)  
	bool                                               bOverride_LumenSurfaceCacheResolution : 1;                  // 0x0020:2 (0x0001)  
	unsigned char                                      UnknownData09_3[0x3];                                       // 0x0021   (0x0003)  MISSED
	bool                                               bOverride_RayTracingGI : 1;                                 // 0x0024:0 (0x0001)  
	bool                                               bOverride_RayTracingGIMaxBounces : 1;                       // 0x0024:1 (0x0001)  
	bool                                               bOverride_RayTracingGISamplesPerPixel : 1;                  // 0x0024:2 (0x0001)  
	bool                                               bOverride_PathTracingMaxBounces : 1;                        // 0x0024:3 (0x0001)  
	bool                                               bOverride_PathTracingSamplesPerPixel : 1;                   // 0x0024:4 (0x0001)  
	bool                                               bOverride_PathTracingFilterWidth : 1;                       // 0x0024:5 (0x0001)  
	bool                                               bOverride_PathTracingEnableEmissive : 1;                    // 0x0024:6 (0x0001)  
	bool                                               bOverride_PathTracingMaxPathExposure : 1;                   // 0x0024:7 (0x0001)  
	bool                                               bOverride_PathTracingEnableReferenceDOF : 1;                // 0x0025:0 (0x0001)  
	bool                                               bOverride_PathTracingEnableReferenceAtmosphere : 1;         // 0x0025:1 (0x0001)  
	bool                                               bOverride_PathTracingEnableDenoiser : 1;                    // 0x0025:2 (0x0001)  
	unsigned char                                      UnknownData10_3[0x2];                                       // 0x0026   (0x0002)  MISSED
	bool                                               bMobileHQGaussian : 1;                                      // 0x0028:0 (0x0001)  
	TEnumAsByte<EBloomMethod>                          BloomMethod;                                                // 0x0029   (0x0001)  
	TEnumAsByte<EAutoExposureMethod>                   AutoExposureMethod;                                         // 0x002A   (0x0001)  
	TEnumAsByte<ETemperatureMethod>                    TemperatureType;                                            // 0x002B   (0x0001)  
	float                                              WhiteTemp;                                                  // 0x002C   (0x0004)  
	float                                              WhiteTint;                                                  // 0x0030   (0x0004)  
	unsigned char                                      UnknownData11_5[0xC];                                       // 0x0034   (0x000C)  MISSED
	FVector4                                           ColorSaturation;                                            // 0x0040   (0x0020)  
	FVector4                                           ColorContrast;                                              // 0x0060   (0x0020)  
	FVector4                                           ColorGamma;                                                 // 0x0080   (0x0020)  
	FVector4                                           ColorGain;                                                  // 0x00A0   (0x0020)  
	FVector4                                           ColorOffset;                                                // 0x00C0   (0x0020)  
	FVector4                                           ColorSaturationShadows;                                     // 0x00E0   (0x0020)  
	FVector4                                           ColorContrastShadows;                                       // 0x0100   (0x0020)  
	FVector4                                           ColorGammaShadows;                                          // 0x0120   (0x0020)  
	FVector4                                           ColorGainShadows;                                           // 0x0140   (0x0020)  
	FVector4                                           ColorOffsetShadows;                                         // 0x0160   (0x0020)  
	FVector4                                           ColorSaturationMidtones;                                    // 0x0180   (0x0020)  
	FVector4                                           ColorContrastMidtones;                                      // 0x01A0   (0x0020)  
	FVector4                                           ColorGammaMidtones;                                         // 0x01C0   (0x0020)  
	FVector4                                           ColorGainMidtones;                                          // 0x01E0   (0x0020)  
	FVector4                                           ColorOffsetMidtones;                                        // 0x0200   (0x0020)  
	FVector4                                           ColorSaturationHighlights;                                  // 0x0220   (0x0020)  
	FVector4                                           ColorContrastHighlights;                                    // 0x0240   (0x0020)  
	FVector4                                           ColorGammaHighlights;                                       // 0x0260   (0x0020)  
	FVector4                                           ColorGainHighlights;                                        // 0x0280   (0x0020)  
	FVector4                                           ColorOffsetHighlights;                                      // 0x02A0   (0x0020)  
	float                                              ColorCorrectionHighlightsMin;                               // 0x02C0   (0x0004)  
	float                                              ColorCorrectionHighlightsMax;                               // 0x02C4   (0x0004)  
	float                                              ColorCorrectionShadowsMax;                                  // 0x02C8   (0x0004)  
	float                                              BlueCorrection;                                             // 0x02CC   (0x0004)  
	float                                              ExpandGamut;                                                // 0x02D0   (0x0004)  
	float                                              ToneCurveAmount;                                            // 0x02D4   (0x0004)  
	float                                              FilmSlope;                                                  // 0x02D8   (0x0004)  
	float                                              FilmToe;                                                    // 0x02DC   (0x0004)  
	float                                              FilmShoulder;                                               // 0x02E0   (0x0004)  
	float                                              FilmBlackClip;                                              // 0x02E4   (0x0004)  
	float                                              FilmWhiteClip;                                              // 0x02E8   (0x0004)  
	FLinearColor                                       SceneColorTint;                                             // 0x02EC   (0x0010)  
	float                                              SceneFringeIntensity;                                       // 0x02FC   (0x0004)  
	float                                              ChromaticAberrationStartOffset;                             // 0x0300   (0x0004)  
	float                                              BloomIntensity;                                             // 0x0304   (0x0004)  
	float                                              BloomThreshold;                                             // 0x0308   (0x0004)  
	float                                              BloomSizeScale;                                             // 0x030C   (0x0004)  
	float                                              Bloom1Size;                                                 // 0x0310   (0x0004)  
	float                                              Bloom2Size;                                                 // 0x0314   (0x0004)  
	float                                              Bloom3Size;                                                 // 0x0318   (0x0004)  
	float                                              Bloom4Size;                                                 // 0x031C   (0x0004)  
	float                                              Bloom5Size;                                                 // 0x0320   (0x0004)  
	float                                              Bloom6Size;                                                 // 0x0324   (0x0004)  
	FLinearColor                                       Bloom1Tint;                                                 // 0x0328   (0x0010)  
	FLinearColor                                       Bloom2Tint;                                                 // 0x0338   (0x0010)  
	FLinearColor                                       Bloom3Tint;                                                 // 0x0348   (0x0010)  
	FLinearColor                                       Bloom4Tint;                                                 // 0x0358   (0x0010)  
	FLinearColor                                       Bloom5Tint;                                                 // 0x0368   (0x0010)  
	FLinearColor                                       Bloom6Tint;                                                 // 0x0378   (0x0010)  
	float                                              BloomConvolutionScatterDispersion;                          // 0x0388   (0x0004)  
	float                                              BloomConvolutionSize;                                       // 0x038C   (0x0004)  
	UTexture2D*                                        BloomConvolutionTexture;                                    // 0x0390   (0x0008)  
	FVector2D                                          BloomConvolutionCenterUV;                                   // 0x0398   (0x0010)  
	float                                              BloomConvolutionPreFilterMin;                               // 0x03A8   (0x0004)  
	float                                              BloomConvolutionPreFilterMax;                               // 0x03AC   (0x0004)  
	float                                              BloomConvolutionPreFilterMult;                              // 0x03B0   (0x0004)  
	float                                              BloomConvolutionBufferScale;                                // 0x03B4   (0x0004)  
	UTexture*                                          BloomDirtMask;                                              // 0x03B8   (0x0008)  
	float                                              BloomDirtMaskIntensity;                                     // 0x03C0   (0x0004)  
	FLinearColor                                       BloomDirtMaskTint;                                          // 0x03C4   (0x0010)  
	TEnumAsByte<EDynamicGlobalIlluminationMethod>      DynamicGlobalIlluminationMethod;                            // 0x03D4   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x03D5   (0x0003)  MISSED
	FLinearColor                                       IndirectLightingColor;                                      // 0x03D8   (0x0010)  
	float                                              IndirectLightingIntensity;                                  // 0x03E8   (0x0004)  
	float                                              LumenSceneLightingQuality;                                  // 0x03EC   (0x0004)  
	float                                              LumenSceneDetail;                                           // 0x03F0   (0x0004)  
	float                                              LumenSceneViewDistance;                                     // 0x03F4   (0x0004)  
	float                                              LumenSceneLightingUpdateSpeed;                              // 0x03F8   (0x0004)  
	float                                              LumenFinalGatherQuality;                                    // 0x03FC   (0x0004)  
	float                                              LumenFinalGatherLightingUpdateSpeed;                        // 0x0400   (0x0004)  
	float                                              LumenMaxTraceDistance;                                      // 0x0404   (0x0004)  
	float                                              LumenDiffuseColorBoost;                                     // 0x0408   (0x0004)  
	float                                              LumenSkylightLeaking;                                       // 0x040C   (0x0004)  
	float                                              LumenFullSkylightLeakingDistance;                           // 0x0410   (0x0004)  
	float                                              LumenSurfaceCacheResolution;                                // 0x0414   (0x0004)  
	ERayTracingGlobalIlluminationType                  RayTracingGIType;                                           // 0x0418   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x0419   (0x0003)  MISSED
	int32_t                                            RayTracingGIMaxBounces;                                     // 0x041C   (0x0004)  
	int32_t                                            RayTracingGISamplesPerPixel;                                // 0x0420   (0x0004)  
	TEnumAsByte<EReflectionMethod>                     ReflectionMethod;                                           // 0x0424   (0x0001)  
	EReflectionsType                                   ReflectionsType;                                            // 0x0425   (0x0001)  
	unsigned char                                      UnknownData14_5[0x2];                                       // 0x0426   (0x0002)  MISSED
	float                                              LumenReflectionQuality;                                     // 0x0428   (0x0004)  
	ELumenRayLightingModeOverride                      LumenRayLightingMode;                                       // 0x042C   (0x0001)  
	bool                                               LumenFrontLayerTranslucencyReflections : 1;                 // 0x042D:0 (0x0001)  
	unsigned char                                      UnknownData15_4[0x2];                                       // 0x042E   (0x0002)  MISSED
	float                                              ScreenSpaceReflectionIntensity;                             // 0x0430   (0x0004)  
	float                                              ScreenSpaceReflectionQuality;                               // 0x0434   (0x0004)  
	float                                              ScreenSpaceReflectionMaxRoughness;                          // 0x0438   (0x0004)  
	float                                              RayTracingReflectionsMaxRoughness;                          // 0x043C   (0x0004)  
	int32_t                                            RayTracingReflectionsMaxBounces;                            // 0x0440   (0x0004)  
	int32_t                                            RayTracingReflectionsSamplesPerPixel;                       // 0x0444   (0x0004)  
	EReflectedAndRefractedRayTracedShadows             RayTracingReflectionsShadows;                               // 0x0448   (0x0001)  
	bool                                               RayTracingReflectionsTranslucency : 1;                      // 0x0449:0 (0x0001)  
	unsigned char                                      UnknownData16_4[0x2];                                       // 0x044A   (0x0002)  MISSED
	FLinearColor                                       AmbientCubemapTint;                                         // 0x044C   (0x0010)  
	float                                              AmbientCubemapIntensity;                                    // 0x045C   (0x0004)  
	UTextureCube*                                      AmbientCubemap;                                             // 0x0460   (0x0008)  
	float                                              CameraShutterSpeed;                                         // 0x0468   (0x0004)  
	float                                              CameraISO;                                                  // 0x046C   (0x0004)  
	float                                              DepthOfFieldFstop;                                          // 0x0470   (0x0004)  
	float                                              DepthOfFieldMinFstop;                                       // 0x0474   (0x0004)  
	int32_t                                            DepthOfFieldBladeCount;                                     // 0x0478   (0x0004)  
	float                                              AutoExposureBias;                                           // 0x047C   (0x0004)  
	float                                              AutoExposureBiasBackup;                                     // 0x0480   (0x0004)  
	bool                                               bOverride_AutoExposureBiasBackup : 1;                       // 0x0484:0 (0x0001)  
	unsigned char                                      UnknownData17_3[0x3];                                       // 0x0485   (0x0003)  MISSED
	bool                                               AutoExposureApplyPhysicalCameraExposure : 1;                // 0x0488:0 (0x0001)  
	unsigned char                                      UnknownData18_4[0x7];                                       // 0x0489   (0x0007)  MISSED
	UCurveFloat*                                       AutoExposureBiasCurve;                                      // 0x0490   (0x0008)  
	UTexture*                                          AutoExposureMeterMask;                                      // 0x0498   (0x0008)  
	float                                              AutoExposureLowPercent;                                     // 0x04A0   (0x0004)  
	float                                              AutoExposureHighPercent;                                    // 0x04A4   (0x0004)  
	float                                              AutoExposureMinBrightness;                                  // 0x04A8   (0x0004)  
	float                                              AutoExposureMaxBrightness;                                  // 0x04AC   (0x0004)  
	float                                              AutoExposureSpeedUp;                                        // 0x04B0   (0x0004)  
	float                                              AutoExposureSpeedDown;                                      // 0x04B4   (0x0004)  
	float                                              HistogramLogMin;                                            // 0x04B8   (0x0004)  
	float                                              HistogramLogMax;                                            // 0x04BC   (0x0004)  
	float                                              AutoExposureCalibrationConstant;                            // 0x04C0   (0x0004)  
	float                                              LocalExposureContrastScale;                                 // 0x04C4   (0x0004)  
	float                                              LocalExposureHighlightContrastScale;                        // 0x04C8   (0x0004)  
	float                                              LocalExposureShadowContrastScale;                           // 0x04CC   (0x0004)  
	float                                              LocalExposureDetailStrength;                                // 0x04D0   (0x0004)  
	float                                              LocalExposureBlurredLuminanceBlend;                         // 0x04D4   (0x0004)  
	float                                              LocalExposureBlurredLuminanceKernelSizePercent;             // 0x04D8   (0x0004)  
	float                                              LocalExposureMiddleGreyBias;                                // 0x04DC   (0x0004)  
	float                                              LensFlareIntensity;                                         // 0x04E0   (0x0004)  
	FLinearColor                                       LensFlareTint;                                              // 0x04E4   (0x0010)  
	float                                              LensFlareBokehSize;                                         // 0x04F4   (0x0004)  
	float                                              LensFlareThreshold;                                         // 0x04F8   (0x0004)  
	unsigned char                                      UnknownData19_5[0x4];                                       // 0x04FC   (0x0004)  MISSED
	UTexture*                                          LensFlareBokehShape;                                        // 0x0500   (0x0008)  
	FLinearColor                                       LensFlareTints;                                             // 0x0508   (0x0080)  
	float                                              VignetteIntensity;                                          // 0x0588   (0x0004)  
	float                                              GrainJitter;                                                // 0x058C   (0x0004)  
	float                                              GrainIntensity;                                             // 0x0590   (0x0004)  
	float                                              FilmGrainIntensity;                                         // 0x0594   (0x0004)  
	float                                              FilmGrainIntensityShadows;                                  // 0x0598   (0x0004)  
	float                                              FilmGrainIntensityMidtones;                                 // 0x059C   (0x0004)  
	float                                              FilmGrainIntensityHighlights;                               // 0x05A0   (0x0004)  
	float                                              FilmGrainShadowsMax;                                        // 0x05A4   (0x0004)  
	float                                              FilmGrainHighlightsMin;                                     // 0x05A8   (0x0004)  
	float                                              FilmGrainHighlightsMax;                                     // 0x05AC   (0x0004)  
	float                                              FilmGrainTexelSize;                                         // 0x05B0   (0x0004)  
	unsigned char                                      UnknownData20_5[0x4];                                       // 0x05B4   (0x0004)  MISSED
	UTexture2D*                                        FilmGrainTexture;                                           // 0x05B8   (0x0008)  
	float                                              AmbientOcclusionIntensity;                                  // 0x05C0   (0x0004)  
	float                                              AmbientOcclusionStaticFraction;                             // 0x05C4   (0x0004)  
	float                                              AmbientOcclusionRadius;                                     // 0x05C8   (0x0004)  
	bool                                               AmbientOcclusionRadiusInWS : 1;                             // 0x05CC:0 (0x0001)  
	unsigned char                                      UnknownData21_4[0x3];                                       // 0x05CD   (0x0003)  MISSED
	float                                              AmbientOcclusionFadeDistance;                               // 0x05D0   (0x0004)  
	float                                              AmbientOcclusionFadeRadius;                                 // 0x05D4   (0x0004)  
	float                                              AmbientOcclusionDistance;                                   // 0x05D8   (0x0004)  
	float                                              AmbientOcclusionPower;                                      // 0x05DC   (0x0004)  
	float                                              AmbientOcclusionBias;                                       // 0x05E0   (0x0004)  
	float                                              AmbientOcclusionQuality;                                    // 0x05E4   (0x0004)  
	float                                              AmbientOcclusionMipBlend;                                   // 0x05E8   (0x0004)  
	float                                              AmbientOcclusionMipScale;                                   // 0x05EC   (0x0004)  
	float                                              AmbientOcclusionMipThreshold;                               // 0x05F0   (0x0004)  
	float                                              AmbientOcclusionTemporalBlendWeight;                        // 0x05F4   (0x0004)  
	bool                                               RayTracingAO : 1;                                           // 0x05F8:0 (0x0001)  
	unsigned char                                      UnknownData22_4[0x3];                                       // 0x05F9   (0x0003)  MISSED
	int32_t                                            RayTracingAOSamplesPerPixel;                                // 0x05FC   (0x0004)  
	float                                              RayTracingAOIntensity;                                      // 0x0600   (0x0004)  
	float                                              RayTracingAORadius;                                         // 0x0604   (0x0004)  
	float                                              ColorGradingIntensity;                                      // 0x0608   (0x0004)  
	unsigned char                                      UnknownData23_5[0x4];                                       // 0x060C   (0x0004)  MISSED
	UTexture*                                          ColorGradingLUT;                                            // 0x0610   (0x0008)  
	float                                              DepthOfFieldSensorWidth;                                    // 0x0618   (0x0004)  
	float                                              DepthOfFieldSqueezeFactor;                                  // 0x061C   (0x0004)  
	float                                              DepthOfFieldFocalDistance;                                  // 0x0620   (0x0004)  
	float                                              DepthOfFieldDepthBlurAmount;                                // 0x0624   (0x0004)  
	float                                              DepthOfFieldDepthBlurRadius;                                // 0x0628   (0x0004)  
	float                                              DepthOfFieldFocalRegion;                                    // 0x062C   (0x0004)  
	float                                              DepthOfFieldNearTransitionRegion;                           // 0x0630   (0x0004)  
	float                                              DepthOfFieldFarTransitionRegion;                            // 0x0634   (0x0004)  
	float                                              DepthOfFieldScale;                                          // 0x0638   (0x0004)  
	float                                              DepthOfFieldNearBlurSize;                                   // 0x063C   (0x0004)  
	float                                              DepthOfFieldFarBlurSize;                                    // 0x0640   (0x0004)  
	float                                              DepthOfFieldOcclusion;                                      // 0x0644   (0x0004)  
	float                                              DepthOfFieldSkyFocusDistance;                               // 0x0648   (0x0004)  
	float                                              DepthOfFieldVignetteSize;                                   // 0x064C   (0x0004)  
	float                                              MotionBlurAmount;                                           // 0x0650   (0x0004)  
	float                                              MotionBlurMax;                                              // 0x0654   (0x0004)  
	int32_t                                            MotionBlurTargetFPS;                                        // 0x0658   (0x0004)  
	float                                              MotionBlurPerObjectSize;                                    // 0x065C   (0x0004)  
	float                                              LPVIntensity;                                               // 0x0660   (0x0004)  
	float                                              LPVVplInjectionBias;                                        // 0x0664   (0x0004)  
	float                                              LPVSize;                                                    // 0x0668   (0x0004)  
	float                                              LPVSecondaryOcclusionIntensity;                             // 0x066C   (0x0004)  
	float                                              LPVSecondaryBounceIntensity;                                // 0x0670   (0x0004)  
	float                                              LPVGeometryVolumeBias;                                      // 0x0674   (0x0004)  
	float                                              LPVEmissiveInjectionIntensity;                              // 0x0678   (0x0004)  
	float                                              LPVDirectionalOcclusionIntensity;                           // 0x067C   (0x0004)  
	float                                              LPVDirectionalOcclusionRadius;                              // 0x0680   (0x0004)  
	float                                              LPVDiffuseOcclusionExponent;                                // 0x0684   (0x0004)  
	float                                              LPVSpecularOcclusionExponent;                               // 0x0688   (0x0004)  
	float                                              LPVDiffuseOcclusionIntensity;                               // 0x068C   (0x0004)  
	float                                              LPVSpecularOcclusionIntensity;                              // 0x0690   (0x0004)  
	ETranslucencyType                                  TranslucencyType;                                           // 0x0694   (0x0001)  
	unsigned char                                      UnknownData24_5[0x3];                                       // 0x0695   (0x0003)  MISSED
	float                                              RayTracingTranslucencyMaxRoughness;                         // 0x0698   (0x0004)  
	int32_t                                            RayTracingTranslucencyRefractionRays;                       // 0x069C   (0x0004)  
	int32_t                                            RayTracingTranslucencySamplesPerPixel;                      // 0x06A0   (0x0004)  
	EReflectedAndRefractedRayTracedShadows             RayTracingTranslucencyShadows;                              // 0x06A4   (0x0001)  
	bool                                               RayTracingTranslucencyRefraction : 1;                       // 0x06A5:0 (0x0001)  
	unsigned char                                      UnknownData25_4[0x2];                                       // 0x06A6   (0x0002)  MISSED
	int32_t                                            PathTracingMaxBounces;                                      // 0x06A8   (0x0004)  
	int32_t                                            PathTracingSamplesPerPixel;                                 // 0x06AC   (0x0004)  
	float                                              PathTracingFilterWidth;                                     // 0x06B0   (0x0004)  
	bool                                               PathTracingEnableEmissive : 1;                              // 0x06B4:0 (0x0001)  
	unsigned char                                      UnknownData26_4[0x3];                                       // 0x06B5   (0x0003)  MISSED
	float                                              PathTracingMaxPathExposure;                                 // 0x06B8   (0x0004)  
	bool                                               PathTracingEnableReferenceDOF : 1;                          // 0x06BC:0 (0x0001)  
	bool                                               PathTracingEnableReferenceAtmosphere : 1;                   // 0x06BC:1 (0x0001)  
	bool                                               PathTracingEnableDenoiser : 1;                              // 0x06BC:2 (0x0001)  
	unsigned char                                      UnknownData27_4[0x3];                                       // 0x06BD   (0x0003)  MISSED
	float                                              LPVFadeRange;                                               // 0x06C0   (0x0004)  
	float                                              LPVDirectionalOcclusionFadeRange;                           // 0x06C4   (0x0004)  
	float                                              ScreenPercentage;                                           // 0x06C8   (0x0004)  
	unsigned char                                      UnknownData28_5[0x4];                                       // 0x06CC   (0x0004)  MISSED
	FWeightedBlendables                                WeightedBlendables;                                         // 0x06D0   (0x0010)  
};

/// Struct /Script/Engine.WeightedBlendables
/// Size: 0x0010 (0x000000 - 0x000010)
struct FWeightedBlendables
{ 
	TArray<FWeightedBlendable>                         Array;                                                      // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.WeightedBlendable
/// Size: 0x0010 (0x000000 - 0x000010)
struct FWeightedBlendable
{ 
	float                                              Weight;                                                     // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	UObject*                                           Object;                                                     // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.UniqueNetIdRepl
/// Size: 0x002F (0x000001 - 0x000030)
struct FUniqueNetIdRepl : FUniqueNetIdWrapper
{ 
	unsigned char                                      UnknownData00_2[0x1F];                                      // 0x0001   (0x001F)  MISSED
	TArray<char>                                       ReplicationBytes;                                           // 0x0020   (0x0010)  
};

/// Struct /Script/Engine.AnimNode_Base
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAnimNode_Base
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.InputScaleBiasClamp
/// Size: 0x0030 (0x000000 - 0x000030)
struct FInputScaleBiasClamp
{ 
	bool                                               bMapRange;                                                  // 0x0000   (0x0001)  
	bool                                               bClampResult;                                               // 0x0001   (0x0001)  
	bool                                               bInterpResult;                                              // 0x0002   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0003   (0x0001)  MISSED
	FInputRange                                        InRange;                                                    // 0x0004   (0x0008)  
	FInputRange                                        OutRange;                                                   // 0x000C   (0x0008)  
	float                                              Scale;                                                      // 0x0014   (0x0004)  
	float                                              Bias;                                                       // 0x0018   (0x0004)  
	float                                              ClampMin;                                                   // 0x001C   (0x0004)  
	float                                              ClampMax;                                                   // 0x0020   (0x0004)  
	float                                              InterpSpeedIncreasing;                                      // 0x0024   (0x0004)  
	float                                              InterpSpeedDecreasing;                                      // 0x0028   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/Engine.InputRange
/// Size: 0x0008 (0x000000 - 0x000008)
struct FInputRange
{ 
	float                                              Min;                                                        // 0x0000   (0x0004)  
	float                                              Max;                                                        // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.InputAlphaBoolBlend
/// Size: 0x0048 (0x000000 - 0x000048)
struct FInputAlphaBoolBlend
{ 
	float                                              BlendInTime;                                                // 0x0000   (0x0004)  
	float                                              BlendOutTime;                                               // 0x0004   (0x0004)  
	EAlphaBlendOption                                  BlendOption;                                                // 0x0008   (0x0001)  
	bool                                               bInitialized;                                               // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x000A   (0x0006)  MISSED
	UCurveFloat*                                       CustomCurve;                                                // 0x0010   (0x0008)  
	FAlphaBlend                                        AlphaBlend;                                                 // 0x0018   (0x0030)  
};

/// Struct /Script/Engine.AlphaBlend
/// Size: 0x0030 (0x000000 - 0x000030)
struct FAlphaBlend
{ 
	UCurveFloat*                                       CustomCurve;                                                // 0x0000   (0x0008)  
	float                                              BlendTime;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x18];                                      // 0x000C   (0x0018)  MISSED
	EAlphaBlendOption                                  BlendOption;                                                // 0x0024   (0x0001)  
	unsigned char                                      UnknownData01_6[0xB];                                       // 0x0025   (0x000B)  MISSED
};

/// Struct /Script/Engine.InputScaleBias
/// Size: 0x0008 (0x000000 - 0x000008)
struct FInputScaleBias
{ 
	float                                              Scale;                                                      // 0x0000   (0x0004)  
	float                                              Bias;                                                       // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.PoseLinkBase
/// Size: 0x0010 (0x000000 - 0x000010)
struct FPoseLinkBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	int32_t                                            LinkID;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/Engine.ComponentSpacePoseLink
/// Size: 0x0000 (0x000010 - 0x000010)
struct FComponentSpacePoseLink : FPoseLinkBase
{ 
};

/// Struct /Script/Engine.RuntimeFloatCurve
/// Size: 0x0088 (0x000000 - 0x000088)
struct FRuntimeFloatCurve
{ 
	FRichCurve                                         EditorCurveData;                                            // 0x0000   (0x0080)  
	UCurveFloat*                                       ExternalCurve;                                              // 0x0080   (0x0008)  
};

/// Struct /Script/Engine.IndexedCurve
/// Size: 0x0068 (0x000000 - 0x000068)
struct FIndexedCurve
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	FKeyHandleMap                                      KeyHandlesToIndices;                                        // 0x0008   (0x0060)  
};

/// Struct /Script/Engine.KeyHandleMap
/// Size: 0x0060 (0x000000 - 0x000060)
struct FKeyHandleMap
{ 
	unsigned char                                      UnknownData00_1[0x60];                                      // 0x0000   (0x0060)  MISSED
};

/// Struct /Script/Engine.RealCurve
/// Size: 0x0008 (0x000068 - 0x000070)
struct FRealCurve : FIndexedCurve
{ 
	float                                              DefaultValue;                                               // 0x0068   (0x0004)  
	TEnumAsByte<ERichCurveExtrapolation>               PreInfinityExtrap;                                          // 0x006C   (0x0001)  
	TEnumAsByte<ERichCurveExtrapolation>               PostInfinityExtrap;                                         // 0x006D   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x006E   (0x0002)  MISSED
};

/// Struct /Script/Engine.RichCurve
/// Size: 0x0010 (0x000070 - 0x000080)
struct FRichCurve : FRealCurve
{ 
	TArray<FRichCurveKey>                              Keys;                                                       // 0x0070   (0x0010)  
};

/// Struct /Script/Engine.RichCurveKey
/// Size: 0x001C (0x000000 - 0x00001C)
struct FRichCurveKey
{ 
	TEnumAsByte<ERichCurveInterpMode>                  InterpMode;                                                 // 0x0000   (0x0001)  
	TEnumAsByte<ERichCurveTangentMode>                 TangentMode;                                                // 0x0001   (0x0001)  
	TEnumAsByte<ERichCurveTangentWeightMode>           TangentWeightMode;                                          // 0x0002   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0003   (0x0001)  MISSED
	float                                              Time;                                                       // 0x0004   (0x0004)  
	float                                              Value;                                                      // 0x0008   (0x0004)  
	float                                              ArriveTangent;                                              // 0x000C   (0x0004)  
	float                                              ArriveTangentWeight;                                        // 0x0010   (0x0004)  
	float                                              LeaveTangent;                                               // 0x0014   (0x0004)  
	float                                              LeaveTangentWeight;                                         // 0x0018   (0x0004)  
};

/// Struct /Script/Engine.BoneReference
/// Size: 0x0010 (0x000000 - 0x000010)
struct FBoneReference
{ 
	FName                                              BoneName;                                                   // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0008   (0x0008)  MISSED
};

/// Struct /Script/Engine.BoneSocketTarget
/// Size: 0x0090 (0x000000 - 0x000090)
struct FBoneSocketTarget
{ 
	bool                                               bUseSocket;                                                 // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	FBoneReference                                     BoneReference;                                              // 0x0004   (0x0010)  
	unsigned char                                      UnknownData01_5[0xC];                                       // 0x0014   (0x000C)  MISSED
	FSocketReference                                   SocketReference;                                            // 0x0020   (0x0070)  
};

/// Struct /Script/Engine.SocketReference
/// Size: 0x0070 (0x000000 - 0x000070)
struct FSocketReference
{ 
	unsigned char                                      UnknownData00_2[0x60];                                      // 0x0000   (0x0060)  MISSED
	FName                                              SocketName;                                                 // 0x0060   (0x0008)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0068   (0x0008)  MISSED
};

/// Struct /Script/Engine.AnimNodeReference
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAnimNodeReference
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.InputBlendPose
/// Size: 0x0010 (0x000000 - 0x000010)
struct FInputBlendPose
{ 
	TArray<FBranchFilter>                              BranchFilters;                                              // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.BranchFilter
/// Size: 0x000C (0x000000 - 0x00000C)
struct FBranchFilter
{ 
	FName                                              BoneName;                                                   // 0x0000   (0x0008)  
	int32_t                                            BlendDepth;                                                 // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.AnimNode_CustomProperty
/// Size: 0x0048 (0x000010 - 0x000058)
struct FAnimNode_CustomProperty : FAnimNode_Base
{ 
	TArray<FName>                                      SourcePropertyNames;                                        // 0x0010   (0x0010)  
	TArray<FName>                                      DestPropertyNames;                                          // 0x0020   (0x0010)  
	UObject*                                           TargetInstance;                                             // 0x0030   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0038   (0x0020)  MISSED
};

/// Struct /Script/Engine.PoseLink
/// Size: 0x0000 (0x000010 - 0x000010)
struct FPoseLink : FPoseLinkBase
{ 
};

/// Struct /Script/Engine.AnimInstanceProxy
/// Size: 0x0880 (0x000000 - 0x000880)
struct FAnimInstanceProxy
{ 
	unsigned char                                      UnknownData00_1[0x880];                                     // 0x0000   (0x0880)  MISSED
};

/// Struct /Script/Engine.BaseComponentReference
/// Size: 0x0020 (0x000000 - 0x000020)
struct FBaseComponentReference
{ 
	FName                                              ComponentProperty;                                          // 0x0000   (0x0008)  
	FString                                            PathToComponent;                                            // 0x0008   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0018   (0x0008)  MISSED
};

/// Struct /Script/Engine.ComponentReference
/// Size: 0x0008 (0x000020 - 0x000028)
struct FComponentReference : FBaseComponentReference
{ 
	TWeakObjectPtr<AActor*>                            OtherActor;                                                 // 0x0020   (0x0008)  
};

/// Struct /Script/Engine.FloatSpringState
/// Size: 0x000C (0x000000 - 0x00000C)
struct FFloatSpringState
{ 
	unsigned char                                      UnknownData00_1[0xC];                                       // 0x0000   (0x000C)  MISSED
};

/// Struct /Script/Engine.VectorSpringState
/// Size: 0x0038 (0x000000 - 0x000038)
struct FVectorSpringState
{ 
	unsigned char                                      UnknownData00_1[0x38];                                      // 0x0000   (0x0038)  MISSED
};

/// Struct /Script/Engine.QuaternionSpringState
/// Size: 0x0040 (0x000000 - 0x000040)
struct FQuaternionSpringState
{ 
	unsigned char                                      UnknownData00_1[0x40];                                      // 0x0000   (0x0040)  MISSED
};

/// Struct /Script/Engine.PerPlatformBool
/// Size: 0x0001 (0x000000 - 0x000001)
struct FPerPlatformBool
{ 
	bool                                               Default;                                                    // 0x0000   (0x0001)  
};

/// Struct /Script/Engine.PerPlatformInt
/// Size: 0x0004 (0x000000 - 0x000004)
struct FPerPlatformInt
{ 
	int32_t                                            Default;                                                    // 0x0000   (0x0004)  
};

/// Struct /Script/Engine.PerPlatformFloat
/// Size: 0x0004 (0x000000 - 0x000004)
struct FPerPlatformFloat
{ 
	float                                              Default;                                                    // 0x0000   (0x0004)  
};

/// Struct /Script/Engine.SoftComponentReference
/// Size: 0x0030 (0x000020 - 0x000050)
struct FSoftComponentReference : FBaseComponentReference
{ 
	TWeakObjectPtr<AActor*>                            OtherActor;                                                 // 0x0020   (0x0030)  
};

/// Struct /Script/Engine.RawAnimSequenceTrack
/// Size: 0x0030 (0x000000 - 0x000030)
struct FRawAnimSequenceTrack
{ 
	TArray<FVector3f>                                  PosKeys;                                                    // 0x0000   (0x0010)  
	TArray<FQuat4f>                                    RotKeys;                                                    // 0x0010   (0x0010)  
	TArray<FVector3f>                                  ScaleKeys;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/Engine.SoundModulationDestinationSettings
/// Size: 0x0060 (0x000000 - 0x000060)
struct FSoundModulationDestinationSettings
{ 
	float                                              Value;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	USoundModulatorBase*                               Modulator;                                                  // 0x0008   (0x0008)  
	TSet<USoundModulatorBase*>                         Modulators;                                                 // 0x0010   (0x0050)  
};

/// Struct /Script/Engine.PoseSnapshot
/// Size: 0x0038 (0x000000 - 0x000038)
struct FPoseSnapshot
{ 
	TArray<FTransform>                                 LocalTransforms;                                            // 0x0000   (0x0010)  
	TArray<FName>                                      BoneNames;                                                  // 0x0010   (0x0010)  
	FName                                              SkeletalMeshName;                                           // 0x0020   (0x0008)  
	FName                                              SnapshotName;                                               // 0x0028   (0x0008)  
	bool                                               bIsValid;                                                   // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Struct /Script/Engine.AnimNode_Root
/// Size: 0x0010 (0x000010 - 0x000020)
struct FAnimNode_Root : FAnimNode_Base
{ 
	FPoseLink                                          Result;                                                     // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.AnimNode_AssetPlayerRelevancyBase
/// Size: 0x0000 (0x000010 - 0x000010)
struct FAnimNode_AssetPlayerRelevancyBase : FAnimNode_Base
{ 
};

/// Struct /Script/Engine.AnimNode_AssetPlayerBase
/// Size: 0x0028 (0x000010 - 0x000038)
struct FAnimNode_AssetPlayerBase : FAnimNode_AssetPlayerRelevancyBase
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0010   (0x0010)  MISSED
	float                                              BlendWeight;                                                // 0x0020   (0x0004)  
	float                                              InternalTimeAccumulator;                                    // 0x0024   (0x0004)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x0028   (0x0010)  MISSED
};

/// Struct /Script/Engine.PerBoneBlendWeight
/// Size: 0x0008 (0x000000 - 0x000008)
struct FPerBoneBlendWeight
{ 
	int32_t                                            SourceIndex;                                                // 0x0000   (0x0004)  
	float                                              BlendWeight;                                                // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.AnimCurveParam
/// Size: 0x000C (0x000000 - 0x00000C)
struct FAnimCurveParam
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0008   (0x0004)  MISSED
};

/// Struct /Script/Engine.InstanceCacheDataBase
/// Size: 0x0058 (0x000000 - 0x000058)
struct FInstanceCacheDataBase
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	TArray<char>                                       SavedProperties;                                            // 0x0008   (0x0010)  
	FDataCacheDuplicatedObjectData                     UniqueTransientPackage;                                     // 0x0018   (0x0010)  
	TArray<FDataCacheDuplicatedObjectData>             DuplicatedObjects;                                          // 0x0028   (0x0010)  
	TArray<UObject*>                                   ReferencedObjects;                                          // 0x0038   (0x0010)  
	TArray<FName>                                      ReferencedNames;                                            // 0x0048   (0x0010)  
};

/// Struct /Script/Engine.DataCacheDuplicatedObjectData
/// Size: 0x0010 (0x000000 - 0x000010)
struct FDataCacheDuplicatedObjectData
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.ActorComponentInstanceData
/// Size: 0x0010 (0x000058 - 0x000068)
struct FActorComponentInstanceData : FInstanceCacheDataBase
{ 
	UObject*                                           SourceComponentTemplate;                                    // 0x0058   (0x0008)  
	EComponentCreationMethod                           SourceComponentCreationMethod;                              // 0x0060   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0061   (0x0003)  MISSED
	int32_t                                            SourceComponentTypeSerializedIndex;                         // 0x0064   (0x0004)  
};

/// Struct /Script/Engine.SceneComponentInstanceData
/// Size: 0x0050 (0x000068 - 0x0000B8)
struct FSceneComponentInstanceData : FActorComponentInstanceData
{ 
	TMap<USceneComponent*, FTransform>                 AttachedInstanceComponents;                                 // 0x0068   (0x0050)  
};

/// Struct /Script/Engine.RepMovement
/// Size: 0x0070 (0x000000 - 0x000070)
struct FRepMovement
{ 
	FVector                                            LinearVelocity;                                             // 0x0000   (0x0018)  
	FVector                                            AngularVelocity;                                            // 0x0018   (0x0018)  
	FVector                                            Location;                                                   // 0x0030   (0x0018)  
	FRotator                                           Rotation;                                                   // 0x0048   (0x0018)  
	bool                                               bSimulatedPhysicSleep : 1;                                  // 0x0060:0 (0x0001)  
	bool                                               bRepPhysics : 1;                                            // 0x0060:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0061   (0x0003)  MISSED
	int32_t                                            ServerFrame;                                                // 0x0064   (0x0004)  
	int32_t                                            ServerPhysicsHandle;                                        // 0x0068   (0x0004)  
	EVectorQuantization                                LocationQuantizationLevel;                                  // 0x006C   (0x0001)  
	EVectorQuantization                                VelocityQuantizationLevel;                                  // 0x006D   (0x0001)  
	ERotatorQuantization                               RotationQuantizationLevel;                                  // 0x006E   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1];                                       // 0x006F   (0x0001)  MISSED
};

/// Struct /Script/Engine.RepAttachment
/// Size: 0x0060 (0x000000 - 0x000060)
struct FRepAttachment
{ 
	AActor*                                            AttachParent;                                               // 0x0000   (0x0008)  
	FVector_NetQuantize100                             LocationOffset;                                             // 0x0008   (0x0018)  
	FVector_NetQuantize100                             RelativeScale3D;                                            // 0x0020   (0x0018)  
	FRotator                                           RotationOffset;                                             // 0x0038   (0x0018)  
	FName                                              AttachSocket;                                               // 0x0050   (0x0008)  
	USceneComponent*                                   AttachComponent;                                            // 0x0058   (0x0008)  
};

/// Struct /Script/Engine.ActorTickFunction
/// Size: 0x0008 (0x000028 - 0x000030)
struct FActorTickFunction : FTickFunction
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Struct /Script/Engine.ActorDataLayer
/// Size: 0x0008 (0x000000 - 0x000008)
struct FActorDataLayer
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.KAggregateGeom
/// Size: 0x0068 (0x000000 - 0x000068)
struct FKAggregateGeom
{ 
	TArray<FKSphereElem>                               SphereElems;                                                // 0x0000   (0x0010)  
	TArray<FKBoxElem>                                  BoxElems;                                                   // 0x0010   (0x0010)  
	TArray<FKSphylElem>                                SphylElems;                                                 // 0x0020   (0x0010)  
	TArray<FKConvexElem>                               ConvexElems;                                                // 0x0030   (0x0010)  
	TArray<FKTaperedCapsuleElem>                       TaperedCapsuleElems;                                        // 0x0040   (0x0010)  
	TArray<FKLevelSetElem>                             LevelSetElems;                                              // 0x0050   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0060   (0x0008)  MISSED
};

/// Struct /Script/Engine.KShapeElem
/// Size: 0x0030 (0x000000 - 0x000030)
struct FKShapeElem
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	float                                              RestOffset;                                                 // 0x0008   (0x0004)  
	FName                                              Name;                                                       // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	bool                                               bContributeToMass : 1;                                      // 0x0018:0 (0x0001)  
	TEnumAsByte<ECollisionEnabled>                     CollisionEnabled;                                           // 0x0019   (0x0001)  
	unsigned char                                      UnknownData02_6[0x16];                                      // 0x001A   (0x0016)  MISSED
};

/// Struct /Script/Engine.KLevelSetElem
/// Size: 0x0070 (0x000030 - 0x0000A0)
struct FKLevelSetElem : FKShapeElem
{ 
	FTransform                                         Transform;                                                  // 0x0030   (0x0060)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0090   (0x0010)  MISSED
};

/// Struct /Script/Engine.KTaperedCapsuleElem
/// Size: 0x0040 (0x000030 - 0x000070)
struct FKTaperedCapsuleElem : FKShapeElem
{ 
	FVector                                            Center;                                                     // 0x0030   (0x0018)  
	FRotator                                           Rotation;                                                   // 0x0048   (0x0018)  
	float                                              Radius0;                                                    // 0x0060   (0x0004)  
	float                                              Radius1;                                                    // 0x0064   (0x0004)  
	float                                              Length;                                                     // 0x0068   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x006C   (0x0004)  MISSED
};

/// Struct /Script/Engine.KConvexElem
/// Size: 0x00D0 (0x000030 - 0x000100)
struct FKConvexElem : FKShapeElem
{ 
	TArray<FVector>                                    VertexData;                                                 // 0x0030   (0x0010)  
	TArray<int32_t>                                    IndexData;                                                  // 0x0040   (0x0010)  
	FBox                                               ElemBox;                                                    // 0x0050   (0x0038)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0088   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0090   (0x0060)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x00F0   (0x0010)  MISSED
};

/// Struct /Script/Engine.KSphylElem
/// Size: 0x0038 (0x000030 - 0x000068)
struct FKSphylElem : FKShapeElem
{ 
	FVector                                            Center;                                                     // 0x0030   (0x0018)  
	FRotator                                           Rotation;                                                   // 0x0048   (0x0018)  
	float                                              Radius;                                                     // 0x0060   (0x0004)  
	float                                              Length;                                                     // 0x0064   (0x0004)  
};

/// Struct /Script/Engine.KBoxElem
/// Size: 0x0040 (0x000030 - 0x000070)
struct FKBoxElem : FKShapeElem
{ 
	FVector                                            Center;                                                     // 0x0030   (0x0018)  
	FRotator                                           Rotation;                                                   // 0x0048   (0x0018)  
	float                                              X;                                                          // 0x0060   (0x0004)  
	float                                              Y;                                                          // 0x0064   (0x0004)  
	float                                              Z;                                                          // 0x0068   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x006C   (0x0004)  MISSED
};

/// Struct /Script/Engine.KSphereElem
/// Size: 0x0020 (0x000030 - 0x000050)
struct FKSphereElem : FKShapeElem
{ 
	FVector                                            Center;                                                     // 0x0030   (0x0018)  
	float                                              Radius;                                                     // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/Engine.NamedFloat
/// Size: 0x000C (0x000000 - 0x00000C)
struct FNamedFloat
{ 
	float                                              Value;                                                      // 0x0000   (0x0004)  
	FName                                              Name;                                                       // 0x0004   (0x0008)  
};

/// Struct /Script/Engine.NamedVector
/// Size: 0x0020 (0x000000 - 0x000020)
struct FNamedVector
{ 
	FVector                                            Value;                                                      // 0x0000   (0x0018)  
	FName                                              Name;                                                       // 0x0018   (0x0008)  
};

/// Struct /Script/Engine.NamedColor
/// Size: 0x000C (0x000000 - 0x00000C)
struct FNamedColor
{ 
	FColor                                             Value;                                                      // 0x0000   (0x0004)  
	FName                                              Name;                                                       // 0x0004   (0x0008)  
};

/// Struct /Script/Engine.NamedTransform
/// Size: 0x0070 (0x000000 - 0x000070)
struct FNamedTransform
{ 
	FTransform                                         Value;                                                      // 0x0000   (0x0060)  
	FName                                              Name;                                                       // 0x0060   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0068   (0x0008)  MISSED
};

/// Struct /Script/Engine.LocalSpacePose
/// Size: 0x0020 (0x000000 - 0x000020)
struct FLocalSpacePose
{ 
	TArray<FTransform>                                 Transforms;                                                 // 0x0000   (0x0010)  
	TArray<FName>                                      Names;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.ComponentSpacePose
/// Size: 0x0020 (0x000000 - 0x000020)
struct FComponentSpacePose
{ 
	TArray<FTransform>                                 Transforms;                                                 // 0x0000   (0x0010)  
	TArray<FName>                                      Names;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.AnimationErrorStats
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAnimationErrorStats
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.AnimCurveBase
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAnimCurveBase
{ 
	FName                                              LastObservedName;                                           // 0x0000   (0x0008)  
	FSmartName                                         Name;                                                       // 0x0008   (0x000C)  
	int32_t                                            CurveTypeFlags;                                             // 0x0014   (0x0004)  
};

/// Struct /Script/Engine.SmartName
/// Size: 0x000C (0x000000 - 0x00000C)
struct FSmartName
{ 
	FName                                              DisplayName;                                                // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0008   (0x0004)  MISSED
};

/// Struct /Script/Engine.FloatCurve
/// Size: 0x0080 (0x000018 - 0x000098)
struct FFloatCurve : FAnimCurveBase
{ 
	FRichCurve                                         FloatCurve;                                                 // 0x0018   (0x0080)  
};

/// Struct /Script/Engine.VectorCurve
/// Size: 0x0180 (0x000018 - 0x000198)
struct FVectorCurve : FAnimCurveBase
{ 
	FRichCurve                                         FloatCurves;                                                // 0x0018   (0x0180)  
};

/// Struct /Script/Engine.TransformCurve
/// Size: 0x04C8 (0x000018 - 0x0004E0)
struct FTransformCurve : FAnimCurveBase
{ 
	FVectorCurve                                       TranslationCurve;                                           // 0x0018   (0x0198)  
	FVectorCurve                                       RotationCurve;                                              // 0x01B0   (0x0198)  
	FVectorCurve                                       ScaleCurve;                                                 // 0x0348   (0x0198)  
};

/// Struct /Script/Engine.CachedFloatCurve
/// Size: 0x0014 (0x000000 - 0x000014)
struct FCachedFloatCurve
{ 
	FName                                              CurveName;                                                  // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0008   (0x000C)  MISSED
};

/// Struct /Script/Engine.RawCurveTracks
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRawCurveTracks
{ 
	TArray<FFloatCurve>                                FloatCurves;                                                // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.EmptyPayload
/// Size: 0x0001 (0x000000 - 0x000001)
struct FEmptyPayload
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.BracketPayload
/// Size: 0x000F (0x000001 - 0x000010)
struct FBracketPayload : FEmptyPayload
{ 
	FString                                            Description;                                                // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.AnimationTrackPayload
/// Size: 0x0007 (0x000001 - 0x000008)
struct FAnimationTrackPayload : FEmptyPayload
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.AnimationTrackAddedPayload
/// Size: 0x0004 (0x000008 - 0x00000C)
struct FAnimationTrackAddedPayload : FAnimationTrackPayload
{ 
	int32_t                                            TrackIndex;                                                 // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.SequenceLengthChangedPayload
/// Size: 0x000B (0x000001 - 0x00000C)
struct FSequenceLengthChangedPayload : FEmptyPayload
{ 
	float                                              PreviousLength;                                             // 0x0000   (0x0004)  
	float                                              T0;                                                         // 0x0004   (0x0004)  
	float                                              T1;                                                         // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.FrameRateChangedPayload
/// Size: 0x0007 (0x000001 - 0x000008)
struct FFrameRateChangedPayload : FEmptyPayload
{ 
	FFrameRate                                         PreviousFrameRate;                                          // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.CurvePayload
/// Size: 0x000F (0x000001 - 0x000010)
struct FCurvePayload : FEmptyPayload
{ 
	FAnimationCurveIdentifier                          Identifier;                                                 // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.AnimationCurveIdentifier
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAnimationCurveIdentifier
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.CurveScaledPayload
/// Size: 0x0008 (0x000010 - 0x000018)
struct FCurveScaledPayload : FCurvePayload
{ 
	float                                              Factor;                                                     // 0x0010   (0x0004)  
	float                                              Origin;                                                     // 0x0014   (0x0004)  
};

/// Struct /Script/Engine.CurveRenamedPayload
/// Size: 0x0010 (0x000010 - 0x000020)
struct FCurveRenamedPayload : FCurvePayload
{ 
	FAnimationCurveIdentifier                          NewIdentifier;                                              // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.CurveFlagsChangedPayload
/// Size: 0x0004 (0x000010 - 0x000014)
struct FCurveFlagsChangedPayload : FCurvePayload
{ 
	int32_t                                            OldFlags;                                                   // 0x0010   (0x0004)  
};

/// Struct /Script/Engine.AttributePayload
/// Size: 0x003F (0x000001 - 0x000040)
struct FAttributePayload : FEmptyPayload
{ 
	FAnimationAttributeIdentifier                      Identifier;                                                 // 0x0000   (0x0040)  
};

/// Struct /Script/Engine.AnimationAttributeIdentifier
/// Size: 0x0040 (0x000000 - 0x000040)
struct FAnimationAttributeIdentifier
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
	FName                                              BoneName;                                                   // 0x0008   (0x0008)  
	int32_t                                            BoneIndex;                                                  // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	UScriptStruct*                                     ScriptStruct;                                               // 0x0018   (0x0008)  
	FSoftObjectPath                                    ScriptStructPath;                                           // 0x0020   (0x0020)  
};

/// Struct /Script/Engine.AnimNodeConstantData
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAnimNodeConstantData
{ 
	TScriptInterface<Class>                            AnimClassInterface;                                         // 0x0000   (0x0010)  
	int32_t                                            NodeIndex;                                                  // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Engine.AnimSubsystem
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAnimSubsystem
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/Engine.AnimSubsystemInstance
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAnimSubsystemInstance
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/Engine.AnimSubsystem_BlendSpaceGraph
/// Size: 0x0010 (0x000008 - 0x000018)
struct FAnimSubsystem_BlendSpaceGraph : FAnimSubsystem
{ 
	TArray<UBlendSpace*>                               BlendSpaces;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/Engine.PerBoneBlendWeights
/// Size: 0x0010 (0x000000 - 0x000010)
struct FPerBoneBlendWeights
{ 
	TArray<FPerBoneBlendWeight>                        BoneBlendWeights;                                           // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.AnimLinkableElement
/// Size: 0x0030 (0x000000 - 0x000030)
struct FAnimLinkableElement
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	UAnimMontage*                                      LinkedMontage;                                              // 0x0008   (0x0008)  
	int32_t                                            SlotIndex;                                                  // 0x0010   (0x0004)  
	int32_t                                            SegmentIndex;                                               // 0x0014   (0x0004)  
	TEnumAsByte<EAnimLinkMethod>                       LinkMethod;                                                 // 0x0018   (0x0001)  
	TEnumAsByte<EAnimLinkMethod>                       CachedLinkMethod;                                           // 0x0019   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x001A   (0x0002)  MISSED
	float                                              SegmentBeginTime;                                           // 0x001C   (0x0004)  
	float                                              SegmentLength;                                              // 0x0020   (0x0004)  
	float                                              LinkValue;                                                  // 0x0024   (0x0004)  
	UAnimSequenceBase*                                 LinkedSequence;                                             // 0x0028   (0x0008)  
};

/// Struct /Script/Engine.AnimNotifyEvent
/// Size: 0x0088 (0x000030 - 0x0000B8)
struct FAnimNotifyEvent : FAnimLinkableElement
{ 
	float                                              DisplayTime;                                                // 0x0030   (0x0004)  
	float                                              TriggerTimeOffset;                                          // 0x0034   (0x0004)  
	float                                              EndTriggerTimeOffset;                                       // 0x0038   (0x0004)  
	float                                              TriggerWeightThreshold;                                     // 0x003C   (0x0004)  
	FName                                              NotifyName;                                                 // 0x0040   (0x0008)  
	UAnimNotify*                                       Notify;                                                     // 0x0048   (0x0008)  
	UAnimNotifyState*                                  NotifyStateClass;                                           // 0x0050   (0x0008)  
	float                                              Duration;                                                   // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x005C   (0x0004)  MISSED
	FAnimLinkableElement                               EndLink;                                                    // 0x0060   (0x0030)  
	bool                                               bConvertedFromBranchingPoint;                               // 0x0090   (0x0001)  
	TEnumAsByte<EMontageNotifyTickType>                MontageTickType;                                            // 0x0091   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0092   (0x0002)  MISSED
	float                                              NotifyTriggerChance;                                        // 0x0094   (0x0004)  
	TEnumAsByte<ENotifyFilterType>                     NotifyFilterType;                                           // 0x0098   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0099   (0x0003)  MISSED
	int32_t                                            NotifyFilterLOD;                                            // 0x009C   (0x0004)  
	bool                                               bTriggerOnDedicatedServer;                                  // 0x00A0   (0x0001)  
	bool                                               bTriggerOnFollower;                                         // 0x00A1   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x00A2   (0x0002)  MISSED
	int32_t                                            TrackIndex;                                                 // 0x00A4   (0x0004)  
	unsigned char                                      UnknownData04_6[0x10];                                      // 0x00A8   (0x0010)  MISSED
};

/// Struct /Script/Engine.AnimSyncMarker
/// Size: 0x000C (0x000000 - 0x00000C)
struct FAnimSyncMarker
{ 
	FName                                              MarkerName;                                                 // 0x0000   (0x0008)  
	float                                              Time;                                                       // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.AnimNotifyTrack
/// Size: 0x0038 (0x000000 - 0x000038)
struct FAnimNotifyTrack
{ 
	FName                                              TrackName;                                                  // 0x0000   (0x0008)  
	FLinearColor                                       TrackColor;                                                 // 0x0008   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0018   (0x0020)  MISSED
};

/// Struct /Script/Engine.MarkerSyncData
/// Size: 0x0020 (0x000000 - 0x000020)
struct FMarkerSyncData
{ 
	TArray<FAnimSyncMarker>                            AuthoredSyncMarkers;                                        // 0x0000   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0010   (0x0010)  MISSED
};

/// Struct /Script/Engine.TrackToSkeletonMap
/// Size: 0x0004 (0x000000 - 0x000004)
struct FTrackToSkeletonMap
{ 
	int32_t                                            BoneTreeIndex;                                              // 0x0000   (0x0004)  
};

/// Struct /Script/Engine.AssetManagerRedirect
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAssetManagerRedirect
{ 
	FString                                            Old;                                                        // 0x0000   (0x0010)  
	FString                                            New;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.PrimaryAssetRulesOverride
/// Size: 0x001C (0x000000 - 0x00001C)
struct FPrimaryAssetRulesOverride
{ 
	FPrimaryAssetId                                    PrimaryAssetId;                                             // 0x0000   (0x0010)  
	FPrimaryAssetRules                                 Rules;                                                      // 0x0010   (0x000C)  
};

/// Struct /Script/Engine.PrimaryAssetRules
/// Size: 0x000C (0x000000 - 0x00000C)
struct FPrimaryAssetRules
{ 
	int32_t                                            Priority;                                                   // 0x0000   (0x0004)  
	int32_t                                            ChunkId;                                                    // 0x0004   (0x0004)  
	bool                                               bApplyRecursively;                                          // 0x0008   (0x0001)  
	EPrimaryAssetCookRule                              CookRule;                                                   // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x000A   (0x0002)  MISSED
};

/// Struct /Script/Engine.PrimaryAssetRulesCustomOverride
/// Size: 0x0038 (0x000000 - 0x000038)
struct FPrimaryAssetRulesCustomOverride
{ 
	FPrimaryAssetType                                  PrimaryAssetType;                                           // 0x0000   (0x0008)  
	FDirectoryPath                                     FilterDirectory;                                            // 0x0008   (0x0010)  
	FString                                            FilterString;                                               // 0x0018   (0x0010)  
	FPrimaryAssetRules                                 Rules;                                                      // 0x0028   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/Engine.InterpolationParameter
/// Size: 0x0010 (0x000000 - 0x000010)
struct FInterpolationParameter
{ 
	float                                              InterpolationTime;                                          // 0x0000   (0x0004)  
	float                                              DampingRatio;                                               // 0x0004   (0x0004)  
	float                                              MaxSpeed;                                                   // 0x0008   (0x0004)  
	TEnumAsByte<EFilterInterpolationType>              InterpolationType;                                          // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x000D   (0x0003)  MISSED
};

/// Struct /Script/Engine.BlendParameter
/// Size: 0x0020 (0x000000 - 0x000020)
struct FBlendParameter
{ 
	FString                                            DisplayName;                                                // 0x0000   (0x0010)  
	float                                              Min;                                                        // 0x0010   (0x0004)  
	float                                              Max;                                                        // 0x0014   (0x0004)  
	int32_t                                            GridNum;                                                    // 0x0018   (0x0004)  
	bool                                               bSnapToGrid;                                                // 0x001C   (0x0001)  
	bool                                               bWrapInput;                                                 // 0x001D   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x001E   (0x0002)  MISSED
};

/// Struct /Script/Engine.BlendSample
/// Size: 0x0028 (0x000000 - 0x000028)
struct FBlendSample
{ 
	UAnimSequence*                                     Animation;                                                  // 0x0000   (0x0008)  
	FVector                                            SampleValue;                                                // 0x0008   (0x0018)  
	float                                              RateScale;                                                  // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/Engine.BlendSpaceSegment
/// Size: 0x0010 (0x000000 - 0x000010)
struct FBlendSpaceSegment
{ 
	int32_t                                            SampleIndices;                                              // 0x0000   (0x0008)  
	float                                              Vertices;                                                   // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.BlendSpaceTriangleEdgeInfo
/// Size: 0x0028 (0x000000 - 0x000028)
struct FBlendSpaceTriangleEdgeInfo
{ 
	FVector2D                                          Normal;                                                     // 0x0000   (0x0010)  
	int32_t                                            NeighbourTriangleIndex;                                     // 0x0010   (0x0004)  
	int32_t                                            AdjacentPerimeterTriangleIndices;                           // 0x0014   (0x0008)  
	int32_t                                            AdjacentPerimeterVertexIndices;                             // 0x001C   (0x0008)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/Engine.BlendSpaceTriangle
/// Size: 0x00B8 (0x000000 - 0x0000B8)
struct FBlendSpaceTriangle
{ 
	int32_t                                            SampleIndices;                                              // 0x0000   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	FVector2D                                          Vertices;                                                   // 0x0010   (0x0030)  
	FBlendSpaceTriangleEdgeInfo                        EdgeInfo;                                                   // 0x0040   (0x0078)  
};

/// Struct /Script/Engine.WeightedBlendSample
/// Size: 0x0008 (0x000000 - 0x000008)
struct FWeightedBlendSample
{ 
	int32_t                                            SampleIndex;                                                // 0x0000   (0x0004)  
	float                                              SampleWeight;                                               // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.BlendSpaceData
/// Size: 0x0020 (0x000000 - 0x000020)
struct FBlendSpaceData
{ 
	TArray<FBlendSpaceSegment>                         Segments;                                                   // 0x0000   (0x0010)  
	TArray<FBlendSpaceTriangle>                        Triangles;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.EditorElement
/// Size: 0x0018 (0x000000 - 0x000018)
struct FEditorElement
{ 
	int32_t                                            Indices;                                                    // 0x0000   (0x000C)  
	float                                              Weights;                                                    // 0x000C   (0x000C)  
};

/// Struct /Script/Engine.GridBlendSample
/// Size: 0x001C (0x000000 - 0x00001C)
struct FGridBlendSample
{ 
	FEditorElement                                     GridElement;                                                // 0x0000   (0x0018)  
	float                                              BlendWeight;                                                // 0x0018   (0x0004)  
};

/// Struct /Script/Engine.PerBoneInterpolation
/// Size: 0x0014 (0x000000 - 0x000014)
struct FPerBoneInterpolation
{ 
	FBoneReference                                     BoneReference;                                              // 0x0000   (0x0010)  
	float                                              InterpolationSpeedPerSec;                                   // 0x0010   (0x0004)  
};

/// Struct /Script/Engine.CompilerNativizationOptions
/// Size: 0x0080 (0x000000 - 0x000080)
struct FCompilerNativizationOptions
{ 
	FName                                              PlatformName;                                               // 0x0000   (0x0008)  
	bool                                               ServerOnlyPlatform;                                         // 0x0008   (0x0001)  
	bool                                               ClientOnlyPlatform;                                         // 0x0009   (0x0001)  
	bool                                               bExcludeMonolithicHeaders;                                  // 0x000A   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x000B   (0x0005)  MISSED
	TArray<FName>                                      ExcludedModules;                                            // 0x0010   (0x0010)  
	TSet<FSoftObjectPath>                              ExcludedAssets;                                             // 0x0020   (0x0050)  
	TArray<FString>                                    ExcludedFolderPaths;                                        // 0x0070   (0x0010)  
};

/// Struct /Script/Engine.BlueprintMacroCosmeticInfo
/// Size: 0x0001 (0x000000 - 0x000001)
struct FBlueprintMacroCosmeticInfo
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.BPVariableMetaDataEntry
/// Size: 0x0018 (0x000000 - 0x000018)
struct FBPVariableMetaDataEntry
{ 
	FName                                              DataKey;                                                    // 0x0000   (0x0008)  
	FString                                            DataValue;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/Engine.BPVariableDescription
/// Size: 0x00D0 (0x000000 - 0x0000D0)
struct FBPVariableDescription
{ 
	FName                                              VarName;                                                    // 0x0000   (0x0008)  
	FGuid                                              VarGuid;                                                    // 0x0008   (0x0010)  
	FEdGraphPinType                                    VarType;                                                    // 0x0018   (0x0058)  
	FString                                            FriendlyName;                                               // 0x0070   (0x0010)  
	FText                                              Category;                                                   // 0x0080   (0x0018)  
	uint64_t                                           PropertyFlags;                                              // 0x0098   (0x0008)  
	FName                                              RepNotifyFunc;                                              // 0x00A0   (0x0008)  
	TEnumAsByte<ELifetimeCondition>                    ReplicationCondition;                                       // 0x00A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x00A9   (0x0007)  MISSED
	TArray<FBPVariableMetaDataEntry>                   MetaDataArray;                                              // 0x00B0   (0x0010)  
	FString                                            DefaultValue;                                               // 0x00C0   (0x0010)  
};

/// Struct /Script/Engine.EdGraphPinType
/// Size: 0x0058 (0x000000 - 0x000058)
struct FEdGraphPinType
{ 
	FName                                              PinCategory;                                                // 0x0000   (0x0008)  
	FName                                              PinSubCategory;                                             // 0x0008   (0x0008)  
	TWeakObjectPtr<UObject*>                           PinSubCategoryObject;                                       // 0x0010   (0x0008)  
	FSimpleMemberReference                             PinSubCategoryMemberReference;                              // 0x0018   (0x0020)  
	FEdGraphTerminalType                               PinValueType;                                               // 0x0038   (0x001C)  
	EPinContainerType                                  ContainerType;                                              // 0x0054   (0x0001)  
	bool                                               bIsArray : 1;                                               // 0x0055:0 (0x0001)  
	bool                                               bIsReference : 1;                                           // 0x0055:1 (0x0001)  
	bool                                               bIsConst : 1;                                               // 0x0055:2 (0x0001)  
	bool                                               bIsWeakPointer : 1;                                         // 0x0055:3 (0x0001)  
	bool                                               bIsUObjectWrapper : 1;                                      // 0x0055:4 (0x0001)  
	bool                                               bSerializeAsSinglePrecisionFloat : 1;                       // 0x0055:5 (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0056   (0x0002)  MISSED
};

/// Struct /Script/Engine.EdGraphTerminalType
/// Size: 0x001C (0x000000 - 0x00001C)
struct FEdGraphTerminalType
{ 
	FName                                              TerminalCategory;                                           // 0x0000   (0x0008)  
	FName                                              TerminalSubCategory;                                        // 0x0008   (0x0008)  
	TWeakObjectPtr<UObject*>                           TerminalSubCategoryObject;                                  // 0x0010   (0x0008)  
	bool                                               bTerminalIsConst;                                           // 0x0018   (0x0001)  
	bool                                               bTerminalIsWeakPointer;                                     // 0x0019   (0x0001)  
	bool                                               bTerminalIsUObjectWrapper;                                  // 0x001A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x001B   (0x0001)  MISSED
};

/// Struct /Script/Engine.SimpleMemberReference
/// Size: 0x0020 (0x000000 - 0x000020)
struct FSimpleMemberReference
{ 
	UObject*                                           MemberParent;                                               // 0x0000   (0x0008)  
	FName                                              MemberName;                                                 // 0x0008   (0x0008)  
	FGuid                                              MemberGuid;                                                 // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.BPInterfaceDescription
/// Size: 0x0018 (0x000000 - 0x000018)
struct FBPInterfaceDescription
{ 
	UClass*                                            Interface;                                                  // 0x0000   (0x0008)  
	TArray<UEdGraph*>                                  Graphs;                                                     // 0x0008   (0x0010)  
};

/// Struct /Script/Engine.EditedDocumentInfo
/// Size: 0x0040 (0x000000 - 0x000040)
struct FEditedDocumentInfo
{ 
	FSoftObjectPath                                    EditedObjectPath;                                           // 0x0000   (0x0020)  
	FVector2D                                          SavedViewOffset;                                            // 0x0020   (0x0010)  
	float                                              SavedZoomAmount;                                            // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0034   (0x0004)  MISSED
	UObject*                                           EditedObject;                                               // 0x0038   (0x0008)  
};

/// Struct /Script/Engine.BPEditorBookmarkNode
/// Size: 0x0038 (0x000000 - 0x000038)
struct FBPEditorBookmarkNode
{ 
	FGuid                                              NodeGuid;                                                   // 0x0000   (0x0010)  
	FGuid                                              ParentGuid;                                                 // 0x0010   (0x0010)  
	FText                                              DisplayName;                                                // 0x0020   (0x0018)  
};

/// Struct /Script/Engine.Bookmark2DJumpToSettings
/// Size: 0x0001 (0x000000 - 0x000001)
struct FBookmark2DJumpToSettings
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.BookmarkBaseJumpToSettings
/// Size: 0x0001 (0x000000 - 0x000001)
struct FBookmarkBaseJumpToSettings
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.GeomSelection
/// Size: 0x000C (0x000000 - 0x00000C)
struct FGeomSelection
{ 
	int32_t                                            Type;                                                       // 0x0000   (0x0004)  
	int32_t                                            Index;                                                      // 0x0004   (0x0004)  
	int32_t                                            SelectionIndex;                                             // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.FloatAnimationAttribute
/// Size: 0x0004 (0x000000 - 0x000004)
struct FFloatAnimationAttribute
{ 
	float                                              Value;                                                      // 0x0000   (0x0004)  
};

/// Struct /Script/Engine.IntegerAnimationAttribute
/// Size: 0x0004 (0x000000 - 0x000004)
struct FIntegerAnimationAttribute
{ 
	int32_t                                            Value;                                                      // 0x0000   (0x0004)  
};

/// Struct /Script/Engine.StringAnimationAttribute
/// Size: 0x0010 (0x000000 - 0x000010)
struct FStringAnimationAttribute
{ 
	FString                                            Value;                                                      // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.TransformAnimationAttribute
/// Size: 0x0060 (0x000000 - 0x000060)
struct FTransformAnimationAttribute
{ 
	FTransform                                         Value;                                                      // 0x0000   (0x0060)  
};

/// Struct /Script/Engine.VectorAnimationAttribute
/// Size: 0x0018 (0x000000 - 0x000018)
struct FVectorAnimationAttribute
{ 
	FVector                                            Value;                                                      // 0x0000   (0x0018)  
};

/// Struct /Script/Engine.QuaternionAnimationAttribute
/// Size: 0x0020 (0x000000 - 0x000020)
struct FQuaternionAnimationAttribute
{ 
	FQuat                                              Value;                                                      // 0x0000   (0x0020)  
};

/// Struct /Script/Engine.NonBlendableQuaternionAnimationAttribute
/// Size: 0x0000 (0x000020 - 0x000020)
struct FNonBlendableQuaternionAnimationAttribute : FQuaternionAnimationAttribute
{ 
};

/// Struct /Script/Engine.NonBlendableVectorAnimationAttribute
/// Size: 0x0000 (0x000018 - 0x000018)
struct FNonBlendableVectorAnimationAttribute : FVectorAnimationAttribute
{ 
};

/// Struct /Script/Engine.NonBlendableTransformAnimationAttribute
/// Size: 0x0000 (0x000060 - 0x000060)
struct FNonBlendableTransformAnimationAttribute : FTransformAnimationAttribute
{ 
};

/// Struct /Script/Engine.NonBlendableFloatAnimationAttribute
/// Size: 0x0000 (0x000004 - 0x000004)
struct FNonBlendableFloatAnimationAttribute : FFloatAnimationAttribute
{ 
};

/// Struct /Script/Engine.NonBlendableIntegerAnimationAttribute
/// Size: 0x0000 (0x000004 - 0x000004)
struct FNonBlendableIntegerAnimationAttribute : FIntegerAnimationAttribute
{ 
};

/// Struct /Script/Engine.MinimalViewInfo
/// Size: 0x07C0 (0x000000 - 0x0007C0)
struct FMinimalViewInfo
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	FRotator                                           Rotation;                                                   // 0x0018   (0x0018)  
	float                                              FOV;                                                        // 0x0030   (0x0004)  
	float                                              DesiredFOV;                                                 // 0x0034   (0x0004)  
	float                                              OrthoWidth;                                                 // 0x0038   (0x0004)  
	float                                              OrthoNearClipPlane;                                         // 0x003C   (0x0004)  
	float                                              OrthoFarClipPlane;                                          // 0x0040   (0x0004)  
	float                                              PerspectiveNearClipPlane;                                   // 0x0044   (0x0004)  
	float                                              AspectRatio;                                                // 0x0048   (0x0004)  
	bool                                               bConstrainAspectRatio : 1;                                  // 0x004C:0 (0x0001)  
	bool                                               bUseFieldOfViewForLOD : 1;                                  // 0x004C:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x004D   (0x0003)  MISSED
	TEnumAsByte<ECameraProjectionMode>                 ProjectionMode;                                             // 0x0050   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0051   (0x0003)  MISSED
	float                                              PostProcessBlendWeight;                                     // 0x0054   (0x0004)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x0058   (0x0008)  MISSED
	FPostProcessSettings                               PostProcessSettings;                                        // 0x0060   (0x06E0)  
	FVector2D                                          OffCenterProjectionOffset;                                  // 0x0740   (0x0010)  
	unsigned char                                      UnknownData03_6[0x70];                                      // 0x0750   (0x0070)  MISSED
};

/// Struct /Script/Engine.TextSizingParameters
/// Size: 0x0038 (0x000000 - 0x000038)
struct FTextSizingParameters
{ 
	float                                              DrawX;                                                      // 0x0000   (0x0004)  
	float                                              DrawY;                                                      // 0x0004   (0x0004)  
	float                                              DrawXL;                                                     // 0x0008   (0x0004)  
	float                                              DrawYL;                                                     // 0x000C   (0x0004)  
	FVector2D                                          Scaling;                                                    // 0x0010   (0x0010)  
	UFont*                                             DrawFont;                                                   // 0x0020   (0x0008)  
	FVector2D                                          SpacingAdjust;                                              // 0x0028   (0x0010)  
};

/// Struct /Script/Engine.WrappedStringElement
/// Size: 0x0020 (0x000000 - 0x000020)
struct FWrappedStringElement
{ 
	FString                                            Value;                                                      // 0x0000   (0x0010)  
	FVector2D                                          LineExtent;                                                 // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.CharacterNetworkSerializationPackedBits
/// Size: 0x0098 (0x000000 - 0x000098)
struct FCharacterNetworkSerializationPackedBits
{ 
	unsigned char                                      UnknownData00_1[0x98];                                      // 0x0000   (0x0098)  MISSED
};

/// Struct /Script/Engine.CharacterServerMovePackedBits
/// Size: 0x0000 (0x000098 - 0x000098)
struct FCharacterServerMovePackedBits : FCharacterNetworkSerializationPackedBits
{ 
};

/// Struct /Script/Engine.CharacterMoveResponsePackedBits
/// Size: 0x0000 (0x000098 - 0x000098)
struct FCharacterMoveResponsePackedBits : FCharacterNetworkSerializationPackedBits
{ 
};

/// Struct /Script/Engine.CharacterNetworkSerializationPackedBitsNetSerializerConfig
/// Size: 0x0007 (0x000001 - 0x000008)
struct FCharacterNetworkSerializationPackedBitsNetSerializerConfig : FNetSerializerConfig
{ 
	uint32_t                                           MaxAllowedDataBits;                                         // 0x0000   (0x0004)  
	uint32_t                                           MaxAllowedObjectReferences;                                 // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.MeshUVChannelInfo
/// Size: 0x0014 (0x000000 - 0x000014)
struct FMeshUVChannelInfo
{ 
	bool                                               bInitialized;                                               // 0x0000   (0x0001)  
	bool                                               bOverrideDensities;                                         // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              LocalUVDensities;                                           // 0x0004   (0x0010)  
};

/// Struct /Script/Engine.CustomAttributeSetting
/// Size: 0x0020 (0x000000 - 0x000020)
struct FCustomAttributeSetting
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	FString                                            Meaning;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.TimecodeCustomAttributeNameSettings
/// Size: 0x0038 (0x000000 - 0x000038)
struct FTimecodeCustomAttributeNameSettings
{ 
	FName                                              HourAttributeName;                                          // 0x0000   (0x0008)  
	FName                                              MinuteAttributeName;                                        // 0x0008   (0x0008)  
	FName                                              SecondAttributeName;                                        // 0x0010   (0x0008)  
	FName                                              FrameAttributeName;                                         // 0x0018   (0x0008)  
	FName                                              SubframeAttributeName;                                      // 0x0020   (0x0008)  
	FName                                              RateAttributeName;                                          // 0x0028   (0x0008)  
	FName                                              TakenameAttributeName;                                      // 0x0030   (0x0008)  
};

/// Struct /Script/Engine.CustomAttribute
/// Size: 0x0001 (0x000000 - 0x000001)
struct FCustomAttribute
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.CustomAttributePerBoneData
/// Size: 0x0001 (0x000000 - 0x000001)
struct FCustomAttributePerBoneData
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.BakedStringCustomAttribute
/// Size: 0x0001 (0x000000 - 0x000001)
struct FBakedStringCustomAttribute
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.BakedIntegerCustomAttribute
/// Size: 0x0001 (0x000000 - 0x000001)
struct FBakedIntegerCustomAttribute
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.BakedFloatCustomAttribute
/// Size: 0x0001 (0x000000 - 0x000001)
struct FBakedFloatCustomAttribute
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.BakedCustomAttributePerBoneData
/// Size: 0x0001 (0x000000 - 0x000001)
struct FBakedCustomAttributePerBoneData
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.DebugDisplayProperty
/// Size: 0x0020 (0x000000 - 0x000020)
struct FDebugDisplayProperty
{ 
	UObject*                                           Obj;                                                        // 0x0000   (0x0008)  
	UClass*                                            WithinClass;                                                // 0x0008   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0010   (0x0010)  MISSED
};

/// Struct /Script/Engine.DebugTextInfo
/// Size: 0x0080 (0x000000 - 0x000080)
struct FDebugTextInfo
{ 
	AActor*                                            SrcActor;                                                   // 0x0000   (0x0008)  
	FVector                                            SrcActorOffset;                                             // 0x0008   (0x0018)  
	FVector                                            SrcActorDesiredOffset;                                      // 0x0020   (0x0018)  
	FString                                            DebugText;                                                  // 0x0038   (0x0010)  
	float                                              TimeRemaining;                                              // 0x0048   (0x0004)  
	float                                              Duration;                                                   // 0x004C   (0x0004)  
	FColor                                             TextColor;                                                  // 0x0050   (0x0004)  
	bool                                               bAbsoluteLocation : 1;                                      // 0x0054:0 (0x0001)  
	bool                                               bKeepAttachedToActor : 1;                                   // 0x0054:1 (0x0001)  
	bool                                               bDrawShadow : 1;                                            // 0x0054:2 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0055   (0x0003)  MISSED
	FVector                                            OrigActorLocation;                                          // 0x0058   (0x0018)  
	UFont*                                             Font;                                                       // 0x0070   (0x0008)  
	float                                              FontScale;                                                  // 0x0078   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x007C   (0x0004)  MISSED
};

/// Struct /Script/Engine.RawDistributionFloat
/// Size: 0x0010 (0x000020 - 0x000030)
struct FRawDistributionFloat : FRawDistribution
{ 
	float                                              MinValue;                                                   // 0x0020   (0x0004)  
	float                                              MaxValue;                                                   // 0x0024   (0x0004)  
	UDistributionFloat*                                Distribution;                                               // 0x0028   (0x0008)  
};

/// Struct /Script/Engine.RawDistributionVector
/// Size: 0x0040 (0x000020 - 0x000060)
struct FRawDistributionVector : FRawDistribution
{ 
	float                                              MinValue;                                                   // 0x0020   (0x0004)  
	float                                              MaxValue;                                                   // 0x0024   (0x0004)  
	FVector                                            MinValueVec;                                                // 0x0028   (0x0018)  
	FVector                                            MaxValueVec;                                                // 0x0040   (0x0018)  
	UDistributionVector*                               Distribution;                                               // 0x0058   (0x0008)  
};

/// Struct /Script/Engine.EdGraphPinReference
/// Size: 0x0018 (0x000000 - 0x000018)
struct FEdGraphPinReference
{ 
	TWeakObjectPtr<UEdGraphNode*>                      OwningNode;                                                 // 0x0000   (0x0008)  
	FGuid                                              PinId;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/Engine.EdGraphSchemaAction
/// Size: 0x0100 (0x000000 - 0x000100)
struct FEdGraphSchemaAction
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	FText                                              MenuDescription;                                            // 0x0008   (0x0018)  
	FText                                              TooltipDescription;                                         // 0x0020   (0x0018)  
	FText                                              Category;                                                   // 0x0038   (0x0018)  
	FText                                              Keywords;                                                   // 0x0050   (0x0018)  
	int32_t                                            Grouping;                                                   // 0x0068   (0x0004)  
	int32_t                                            SectionID;                                                  // 0x006C   (0x0004)  
	TArray<FString>                                    MenuDescriptionArray;                                       // 0x0070   (0x0010)  
	TArray<FString>                                    FullSearchTitlesArray;                                      // 0x0080   (0x0010)  
	TArray<FString>                                    FullSearchKeywordsArray;                                    // 0x0090   (0x0010)  
	TArray<FString>                                    FullSearchCategoryArray;                                    // 0x00A0   (0x0010)  
	TArray<FString>                                    LocalizedMenuDescriptionArray;                              // 0x00B0   (0x0010)  
	TArray<FString>                                    LocalizedFullSearchTitlesArray;                             // 0x00C0   (0x0010)  
	TArray<FString>                                    LocalizedFullSearchKeywordsArray;                           // 0x00D0   (0x0010)  
	TArray<FString>                                    LocalizedFullSearchCategoryArray;                           // 0x00E0   (0x0010)  
	FString                                            SearchText;                                                 // 0x00F0   (0x0010)  
};

/// Struct /Script/Engine.EdGraphSchemaAction_NewNode
/// Size: 0x0008 (0x000100 - 0x000108)
struct FEdGraphSchemaAction_NewNode : FEdGraphSchemaAction
{ 
	UEdGraphNode*                                      NodeTemplate;                                               // 0x0100   (0x0008)  
};

/// Struct /Script/Engine.FullyLoadedPackagesInfo
/// Size: 0x0038 (0x000000 - 0x000038)
struct FFullyLoadedPackagesInfo
{ 
	TEnumAsByte<EFullyLoadPackageType>                 FullyLoadType;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            Tag;                                                        // 0x0008   (0x0010)  
	TArray<FName>                                      PackagesToLoad;                                             // 0x0018   (0x0010)  
	TArray<UObject*>                                   LoadedObjects;                                              // 0x0028   (0x0010)  
};

/// Struct /Script/Engine.LevelStreamingStatus
/// Size: 0x0010 (0x000000 - 0x000010)
struct FLevelStreamingStatus
{ 
	FName                                              PackageName;                                                // 0x0000   (0x0008)  
	bool                                               bShouldBeLoaded : 1;                                        // 0x0008:0 (0x0001)  
	bool                                               bShouldBeVisible : 1;                                       // 0x0008:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0009   (0x0003)  MISSED
	uint32_t                                           LODIndex;                                                   // 0x000C   (0x0004)  
};

/// Struct /Script/Engine.NetDriverDefinition
/// Size: 0x001C (0x000000 - 0x00001C)
struct FNetDriverDefinition
{ 
	FName                                              DefName;                                                    // 0x0000   (0x0008)  
	FName                                              DriverClassName;                                            // 0x0008   (0x0008)  
	FName                                              DriverClassNameFallback;                                    // 0x0010   (0x0008)  
	int32_t                                            MaxChannelsOverride;                                        // 0x0018   (0x0004)  
};

/// Struct /Script/Engine.IrisNetDriverConfig
/// Size: 0x0028 (0x000000 - 0x000028)
struct FIrisNetDriverConfig
{ 
	FName                                              NetDriverDefinition;                                        // 0x0000   (0x0008)  
	FName                                              NetDriverName;                                              // 0x0008   (0x0008)  
	FString                                            NetDriverWildcardName;                                      // 0x0010   (0x0010)  
	bool                                               bEnableIris;                                                // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/Engine.NamedNetDriver
/// Size: 0x0010 (0x000000 - 0x000010)
struct FNamedNetDriver
{ 
	UNetDriver*                                        NetDriver;                                                  // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0008   (0x0008)  MISSED
};

/// Struct /Script/Engine.WorldContext
/// Size: 0x02C8 (0x000000 - 0x0002C8)
struct FWorldContext
{ 
	unsigned char                                      UnknownData00_2[0xC0];                                      // 0x0000   (0x00C0)  MISSED
	FURL                                               LastURL;                                                    // 0x00C0   (0x0068)  
	FURL                                               LastRemoteURL;                                              // 0x0128   (0x0068)  
	UPendingNetGame*                                   PendingNetGame;                                             // 0x0190   (0x0008)  
	TArray<FFullyLoadedPackagesInfo>                   PackagesToFullyLoad;                                        // 0x0198   (0x0010)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x01A8   (0x0010)  MISSED
	TArray<ULevel*>                                    LoadedLevelsForPendingMapChange;                            // 0x01B8   (0x0010)  
	unsigned char                                      UnknownData02_5[0x18];                                      // 0x01C8   (0x0018)  MISSED
	TArray<UObjectReferencer*>                         ObjectReferencers;                                          // 0x01E0   (0x0010)  
	TArray<FLevelStreamingStatus>                      PendingLevelStreamingStatusUpdates;                         // 0x01F0   (0x0010)  
	UGameViewportClient*                               GameViewport;                                               // 0x0200   (0x0008)  
	UGameInstance*                                     OwningGameInstance;                                         // 0x0208   (0x0008)  
	TArray<FNamedNetDriver>                            ActiveNetDrivers;                                           // 0x0210   (0x0010)  
	unsigned char                                      UnknownData03_6[0xA8];                                      // 0x0220   (0x00A8)  MISSED
};

/// Struct /Script/Engine.URL
/// Size: 0x0068 (0x000000 - 0x000068)
struct FURL
{ 
	FString                                            Protocol;                                                   // 0x0000   (0x0010)  
	FString                                            Host;                                                       // 0x0010   (0x0010)  
	int32_t                                            Port;                                                       // 0x0020   (0x0004)  
	int32_t                                            Valid;                                                      // 0x0024   (0x0004)  
	FString                                            Map;                                                        // 0x0028   (0x0010)  
	FString                                            RedirectURL;                                                // 0x0038   (0x0010)  
	TArray<FString>                                    Op;                                                         // 0x0048   (0x0010)  
	FString                                            Portal;                                                     // 0x0058   (0x0010)  
};

/// Struct /Script/Engine.StatColorMapEntry
/// Size: 0x0008 (0x000000 - 0x000008)
struct FStatColorMapEntry
{ 
	float                                              In;                                                         // 0x0000   (0x0004)  
	FColor                                             Out;                                                        // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.StatColorMapping
/// Size: 0x0028 (0x000000 - 0x000028)
struct FStatColorMapping
{ 
	FString                                            StatName;                                                   // 0x0000   (0x0010)  
	TArray<FStatColorMapEntry>                         ColorMap;                                                   // 0x0010   (0x0010)  
	bool                                               DisableBlend : 1;                                           // 0x0020:0 (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/Engine.DropNoteInfo
/// Size: 0x0040 (0x000000 - 0x000040)
struct FDropNoteInfo
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	FRotator                                           Rotation;                                                   // 0x0018   (0x0018)  
	FString                                            Comment;                                                    // 0x0030   (0x0010)  
};

/// Struct /Script/Engine.ScreenMessageString
/// Size: 0x0038 (0x000000 - 0x000038)
struct FScreenMessageString
{ 
	uint64_t                                           Key;                                                        // 0x0000   (0x0008)  
	FString                                            ScreenMessage;                                              // 0x0008   (0x0010)  
	FColor                                             DisplayColor;                                               // 0x0018   (0x0004)  
	float                                              TimeToDisplay;                                              // 0x001C   (0x0004)  
	float                                              CurrentTimeDisplayed;                                       // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0024   (0x0004)  MISSED
	FVector2D                                          TextScale;                                                  // 0x0028   (0x0010)  
};

/// Struct /Script/Engine.GameNameRedirect
/// Size: 0x0010 (0x000000 - 0x000010)
struct FGameNameRedirect
{ 
	FName                                              OldGameName;                                                // 0x0000   (0x0008)  
	FName                                              NewGameName;                                                // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.ClassRedirect
/// Size: 0x003C (0x000000 - 0x00003C)
struct FClassRedirect
{ 
	FName                                              ObjectName;                                                 // 0x0000   (0x0008)  
	FName                                              OldClassName;                                               // 0x0008   (0x0008)  
	FName                                              NewClassName;                                               // 0x0010   (0x0008)  
	FName                                              OldSubobjName;                                              // 0x0018   (0x0008)  
	FName                                              NewSubobjName;                                              // 0x0020   (0x0008)  
	FName                                              NewClassClass;                                              // 0x0028   (0x0008)  
	FName                                              NewClassPackage;                                            // 0x0030   (0x0008)  
	bool                                               InstanceOnly;                                               // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0039   (0x0003)  MISSED
};

/// Struct /Script/Engine.StructRedirect
/// Size: 0x0010 (0x000000 - 0x000010)
struct FStructRedirect
{ 
	FName                                              OldStructName;                                              // 0x0000   (0x0008)  
	FName                                              NewStructName;                                              // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.PluginRedirect
/// Size: 0x0020 (0x000000 - 0x000020)
struct FPluginRedirect
{ 
	FString                                            OldPluginName;                                              // 0x0000   (0x0010)  
	FString                                            NewPluginName;                                              // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.TickPrerequisite
/// Size: 0x0010 (0x000000 - 0x000010)
struct FTickPrerequisite
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.ExposureSettings
/// Size: 0x0008 (0x000000 - 0x000008)
struct FExposureSettings
{ 
	float                                              FixedEV100;                                                 // 0x0000   (0x0004)  
	bool                                               bFixed;                                                     // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0005   (0x0003)  MISSED
};

/// Struct /Script/Engine.MaterialShadingModelField
/// Size: 0x0002 (0x000000 - 0x000002)
struct FMaterialShadingModelField
{ 
	uint16_t                                           ShadingModelField;                                          // 0x0000   (0x0002)  
};

/// Struct /Script/Engine.StrataMaterialInfo
/// Size: 0x0018 (0x000000 - 0x000018)
struct FStrataMaterialInfo
{ 
	uint16_t                                           ShadingModelField;                                          // 0x0000   (0x0002)  
	char                                               bHasShadingModelFromExpression;                             // 0x0002   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0003   (0x0001)  MISSED
	uint32_t                                           ConnectedProperties;                                        // 0x0004   (0x0004)  
	TArray<USubsurfaceProfile*>                        SubsurfaceProfiles;                                         // 0x0008   (0x0010)  
};

/// Struct /Script/Engine.RigidBodyErrorCorrection
/// Size: 0x0034 (0x000000 - 0x000034)
struct FRigidBodyErrorCorrection
{ 
	float                                              PingExtrapolation;                                          // 0x0000   (0x0004)  
	float                                              PingLimit;                                                  // 0x0004   (0x0004)  
	float                                              ErrorPerLinearDifference;                                   // 0x0008   (0x0004)  
	float                                              ErrorPerAngularDifference;                                  // 0x000C   (0x0004)  
	float                                              MaxRestoredStateError;                                      // 0x0010   (0x0004)  
	float                                              MaxLinearHardSnapDistance;                                  // 0x0014   (0x0004)  
	float                                              PositionLerp;                                               // 0x0018   (0x0004)  
	float                                              AngleLerp;                                                  // 0x001C   (0x0004)  
	float                                              LinearVelocityCoefficient;                                  // 0x0020   (0x0004)  
	float                                              AngularVelocityCoefficient;                                 // 0x0024   (0x0004)  
	float                                              ErrorAccumulationSeconds;                                   // 0x0028   (0x0004)  
	float                                              ErrorAccumulationDistanceSq;                                // 0x002C   (0x0004)  
	float                                              ErrorAccumulationSimilarity;                                // 0x0030   (0x0004)  
};

/// Struct /Script/Engine.RigidBodyContactInfo
/// Size: 0x0048 (0x000000 - 0x000048)
struct FRigidBodyContactInfo
{ 
	FVector                                            ContactPosition;                                            // 0x0000   (0x0018)  
	FVector                                            ContactNormal;                                              // 0x0018   (0x0018)  
	float                                              ContactPenetration;                                         // 0x0030   (0x0004)  
	bool                                               bContactProbe;                                              // 0x0034   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	UPhysicalMaterial*                                 PhysMaterial;                                               // 0x0038   (0x0010)  
};

/// Struct /Script/Engine.CollisionImpactData
/// Size: 0x0048 (0x000000 - 0x000048)
struct FCollisionImpactData
{ 
	TArray<FRigidBodyContactInfo>                      ContactInfos;                                               // 0x0000   (0x0010)  
	FVector                                            TotalNormalImpulse;                                         // 0x0010   (0x0018)  
	FVector                                            TotalFrictionImpulse;                                       // 0x0028   (0x0018)  
	bool                                               bIsVelocityDeltaUnderThreshold;                             // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0041   (0x0007)  MISSED
};

/// Struct /Script/Engine.FractureEffect
/// Size: 0x0010 (0x000000 - 0x000010)
struct FFractureEffect
{ 
	UParticleSystem*                                   ParticleSystem;                                             // 0x0000   (0x0008)  
	USoundBase*                                        Sound;                                                      // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.BasedPosition
/// Size: 0x0068 (0x000000 - 0x000068)
struct FBasedPosition
{ 
	AActor*                                            Base;                                                       // 0x0000   (0x0008)  
	FVector                                            Position;                                                   // 0x0008   (0x0018)  
	FVector                                            CachedBaseLocation;                                         // 0x0020   (0x0018)  
	FRotator                                           CachedBaseRotation;                                         // 0x0038   (0x0018)  
	FVector                                            CachedTransPosition;                                        // 0x0050   (0x0018)  
};

/// Struct /Script/Engine.LightmassLightSettings
/// Size: 0x000C (0x000000 - 0x00000C)
struct FLightmassLightSettings
{ 
	float                                              IndirectLightingSaturation;                                 // 0x0000   (0x0004)  
	float                                              ShadowExponent;                                             // 0x0004   (0x0004)  
	bool                                               bUseAreaShadowsForStationaryLight;                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
};

/// Struct /Script/Engine.LightmassPointLightSettings
/// Size: 0x0000 (0x00000C - 0x00000C)
struct FLightmassPointLightSettings : FLightmassLightSettings
{ 
};

/// Struct /Script/Engine.LightmassDirectionalLightSettings
/// Size: 0x0004 (0x00000C - 0x000010)
struct FLightmassDirectionalLightSettings : FLightmassLightSettings
{ 
	float                                              LightSourceAngle;                                           // 0x000C   (0x0004)  
};

/// Struct /Script/Engine.LightmassPrimitiveSettings
/// Size: 0x0018 (0x000000 - 0x000018)
struct FLightmassPrimitiveSettings
{ 
	bool                                               bUseTwoSidedLighting : 1;                                   // 0x0000:0 (0x0001)  
	bool                                               bShadowIndirectOnly : 1;                                    // 0x0000:1 (0x0001)  
	bool                                               bUseEmissiveForStaticLighting : 1;                          // 0x0000:2 (0x0001)  
	bool                                               bUseVertexNormalForHemisphereGather : 1;                    // 0x0000:3 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              EmissiveLightFalloffExponent;                               // 0x0004   (0x0004)  
	float                                              EmissiveLightExplicitInfluenceRadius;                       // 0x0008   (0x0004)  
	float                                              EmissiveBoost;                                              // 0x000C   (0x0004)  
	float                                              DiffuseBoost;                                               // 0x0010   (0x0004)  
	float                                              FullyOccludedSamplesFraction;                               // 0x0014   (0x0004)  
};

/// Struct /Script/Engine.LightmassDebugOptions
/// Size: 0x0010 (0x000000 - 0x000010)
struct FLightmassDebugOptions
{ 
	bool                                               bDebugMode : 1;                                             // 0x0000:0 (0x0001)  
	bool                                               bStatsEnabled : 1;                                          // 0x0000:1 (0x0001)  
	bool                                               bGatherBSPSurfacesAcrossComponents : 1;                     // 0x0000:2 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              CoplanarTolerance;                                          // 0x0004   (0x0004)  
	bool                                               bUseImmediateImport : 1;                                    // 0x0008:0 (0x0001)  
	bool                                               bImmediateProcessMappings : 1;                              // 0x0008:1 (0x0001)  
	bool                                               bSortMappings : 1;                                          // 0x0008:2 (0x0001)  
	bool                                               bDumpBinaryFiles : 1;                                       // 0x0008:3 (0x0001)  
	bool                                               bDebugMaterials : 1;                                        // 0x0008:4 (0x0001)  
	bool                                               bPadMappings : 1;                                           // 0x0008:5 (0x0001)  
	bool                                               bDebugPaddings : 1;                                         // 0x0008:6 (0x0001)  
	bool                                               bOnlyCalcDebugTexelMappings : 1;                            // 0x0008:7 (0x0001)  
	bool                                               bUseRandomColors : 1;                                       // 0x0009:0 (0x0001)  
	bool                                               bColorBordersGreen : 1;                                     // 0x0009:1 (0x0001)  
	bool                                               bColorByExecutionTime : 1;                                  // 0x0009:2 (0x0001)  
	unsigned char                                      UnknownData01_4[0x2];                                       // 0x000A   (0x0002)  MISSED
	float                                              ExecutionTimeDivisor;                                       // 0x000C   (0x0004)  
};

/// Struct /Script/Engine.SwarmDebugOptions
/// Size: 0x0004 (0x000000 - 0x000004)
struct FSwarmDebugOptions
{ 
	bool                                               bDistributionEnabled : 1;                                   // 0x0000:0 (0x0001)  
	bool                                               bForceContentExport : 1;                                    // 0x0000:1 (0x0001)  
	bool                                               bInitialized : 1;                                           // 0x0000:2 (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
};

/// Struct /Script/Engine.MTDResult
/// Size: 0x0020 (0x000000 - 0x000020)
struct FMTDResult
{ 
	FVector                                            Direction;                                                  // 0x0000   (0x0018)  
	float                                              Distance;                                                   // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/Engine.AnimSlotDesc
/// Size: 0x000C (0x000000 - 0x00000C)
struct FAnimSlotDesc
{ 
	FName                                              SlotName;                                                   // 0x0000   (0x0008)  
	int32_t                                            NumChannels;                                                // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.AnimUpdateRateParameters
/// Size: 0x0088 (0x000000 - 0x000088)
struct FAnimUpdateRateParameters
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
	EUpdateRateShiftBucket                             ShiftBucket;                                                // 0x0001   (0x0001)  
	bool                                               bInterpolateSkippedFrames : 1;                              // 0x0002:0 (0x0001)  
	bool                                               bShouldUseLodMap : 1;                                       // 0x0002:1 (0x0001)  
	bool                                               bShouldUseMinLod : 1;                                       // 0x0002:2 (0x0001)  
	bool                                               bSkipUpdate : 1;                                            // 0x0002:3 (0x0001)  
	bool                                               bSkipEvaluation : 1;                                        // 0x0002:4 (0x0001)  
	unsigned char                                      UnknownData01_4[0x1];                                       // 0x0003   (0x0001)  MISSED
	int32_t                                            UpdateRate;                                                 // 0x0004   (0x0004)  
	int32_t                                            EvaluationRate;                                             // 0x0008   (0x0004)  
	float                                              TickedPoseOffestTime;                                       // 0x000C   (0x0004)  
	float                                              AdditionalTime;                                             // 0x0010   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	int32_t                                            BaseNonRenderedUpdateRate;                                  // 0x0018   (0x0004)  
	int32_t                                            MaxEvalRateForInterpolation;                                // 0x001C   (0x0004)  
	TArray<float>                                      BaseVisibleDistanceFactorThesholds;                         // 0x0020   (0x0010)  
	TMap<int32_t, int32_t>                             LODToFrameSkipMap;                                          // 0x0030   (0x0050)  
	int32_t                                            SkippedUpdateFrames;                                        // 0x0080   (0x0004)  
	int32_t                                            SkippedEvalFrames;                                          // 0x0084   (0x0004)  
};

/// Struct /Script/Engine.POV
/// Size: 0x0038 (0x000000 - 0x000038)
struct FPOV
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	FRotator                                           Rotation;                                                   // 0x0018   (0x0018)  
	float                                              FOV;                                                        // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/Engine.MeshBuildSettings
/// Size: 0x0048 (0x000000 - 0x000048)
struct FMeshBuildSettings
{ 
	bool                                               bUseMikkTSpace : 1;                                         // 0x0000:0 (0x0001)  
	bool                                               bRecomputeNormals : 1;                                      // 0x0000:1 (0x0001)  
	bool                                               bRecomputeTangents : 1;                                     // 0x0000:2 (0x0001)  
	bool                                               bComputeWeightedNormals : 1;                                // 0x0000:3 (0x0001)  
	bool                                               bRemoveDegenerates : 1;                                     // 0x0000:4 (0x0001)  
	bool                                               bBuildReversedIndexBuffer : 1;                              // 0x0000:5 (0x0001)  
	bool                                               bUseHighPrecisionTangentBasis : 1;                          // 0x0000:6 (0x0001)  
	bool                                               bUseFullPrecisionUVs : 1;                                   // 0x0000:7 (0x0001)  
	bool                                               bUseBackwardsCompatibleF16TruncUVs : 1;                     // 0x0001:0 (0x0001)  
	bool                                               bGenerateLightmapUVs : 1;                                   // 0x0001:1 (0x0001)  
	bool                                               bGenerateDistanceFieldAsIfTwoSided : 1;                     // 0x0001:2 (0x0001)  
	bool                                               bSupportFaceRemap : 1;                                      // 0x0001:3 (0x0001)  
	unsigned char                                      UnknownData00_4[0x2];                                       // 0x0002   (0x0002)  MISSED
	int32_t                                            MinLightmapResolution;                                      // 0x0004   (0x0004)  
	int32_t                                            SrcLightmapIndex;                                           // 0x0008   (0x0004)  
	int32_t                                            DstLightmapIndex;                                           // 0x000C   (0x0004)  
	float                                              BuildScale;                                                 // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FVector                                            BuildScale3D;                                               // 0x0018   (0x0018)  
	float                                              DistanceFieldResolutionScale;                               // 0x0030   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0034   (0x0004)  MISSED
	UStaticMesh*                                       DistanceFieldReplacementMesh;                               // 0x0038   (0x0008)  
	int32_t                                            MaxLumenMeshCards;                                          // 0x0040   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Struct /Script/Engine.SkeletalMeshBuildSettings
/// Size: 0x0014 (0x000000 - 0x000014)
struct FSkeletalMeshBuildSettings
{ 
	bool                                               bRecomputeNormals : 1;                                      // 0x0000:0 (0x0001)  
	bool                                               bRecomputeTangents : 1;                                     // 0x0000:1 (0x0001)  
	bool                                               bUseMikkTSpace : 1;                                         // 0x0000:2 (0x0001)  
	bool                                               bComputeWeightedNormals : 1;                                // 0x0000:3 (0x0001)  
	bool                                               bRemoveDegenerates : 1;                                     // 0x0000:4 (0x0001)  
	bool                                               bUseHighPrecisionTangentBasis : 1;                          // 0x0000:5 (0x0001)  
	bool                                               bUseFullPrecisionUVs : 1;                                   // 0x0000:6 (0x0001)  
	bool                                               bUseBackwardsCompatibleF16TruncUVs : 1;                     // 0x0000:7 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              ThresholdPosition;                                          // 0x0004   (0x0004)  
	float                                              ThresholdTangentNormal;                                     // 0x0008   (0x0004)  
	float                                              ThresholdUV;                                                // 0x000C   (0x0004)  
	float                                              MorphThresholdPosition;                                     // 0x0010   (0x0004)  
};

/// Struct /Script/Engine.MeshNaniteSettings
/// Size: 0x001C (0x000000 - 0x00001C)
struct FMeshNaniteSettings
{ 
	bool                                               bEnabled : 1;                                               // 0x0000:0 (0x0001)  
	bool                                               bPreserveArea : 1;                                          // 0x0000:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            PositionPrecision;                                          // 0x0004   (0x0004)  
	uint32_t                                           TargetMinimumResidencyInKB;                                 // 0x0008   (0x0004)  
	float                                              KeepPercentTriangles;                                       // 0x000C   (0x0004)  
	float                                              TrimRelativeError;                                          // 0x0010   (0x0004)  
	float                                              FallbackPercentTriangles;                                   // 0x0014   (0x0004)  
	float                                              FallbackRelativeError;                                      // 0x0018   (0x0004)  
};

/// Struct /Script/Engine.ConstrainComponentPropName
/// Size: 0x0008 (0x000000 - 0x000008)
struct FConstrainComponentPropName
{ 
	FName                                              ComponentName;                                              // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.CollectionReference
/// Size: 0x0008 (0x000000 - 0x000008)
struct FCollectionReference
{ 
	FName                                              CollectionName;                                             // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.Redirector
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRedirector
{ 
	FName                                              OldName;                                                    // 0x0000   (0x0008)  
	FName                                              NewName;                                                    // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.DepthFieldGlowInfo
/// Size: 0x0038 (0x000000 - 0x000038)
struct FDepthFieldGlowInfo
{ 
	bool                                               bEnableGlow : 1;                                            // 0x0000:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0001   (0x0003)  MISSED
	FLinearColor                                       GlowColor;                                                  // 0x0004   (0x0010)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FVector2D                                          GlowOuterRadius;                                            // 0x0018   (0x0010)  
	FVector2D                                          GlowInnerRadius;                                            // 0x0028   (0x0010)  
};

/// Struct /Script/Engine.FontRenderInfo
/// Size: 0x0040 (0x000000 - 0x000040)
struct FFontRenderInfo
{ 
	bool                                               bClipText : 1;                                              // 0x0000:0 (0x0001)  
	bool                                               bEnableShadow : 1;                                          // 0x0000:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x7];                                       // 0x0001   (0x0007)  MISSED
	FDepthFieldGlowInfo                                GlowInfo;                                                   // 0x0008   (0x0038)  
};

/// Struct /Script/Engine.CanvasUVTri
/// Size: 0x0090 (0x000000 - 0x000090)
struct FCanvasUVTri
{ 
	FVector2D                                          V0_Pos;                                                     // 0x0000   (0x0010)  
	FVector2D                                          V0_UV;                                                      // 0x0010   (0x0010)  
	FLinearColor                                       V0_Color;                                                   // 0x0020   (0x0010)  
	FVector2D                                          V1_Pos;                                                     // 0x0030   (0x0010)  
	FVector2D                                          V1_UV;                                                      // 0x0040   (0x0010)  
	FLinearColor                                       V1_Color;                                                   // 0x0050   (0x0010)  
	FVector2D                                          V2_Pos;                                                     // 0x0060   (0x0010)  
	FVector2D                                          V2_UV;                                                      // 0x0070   (0x0010)  
	FLinearColor                                       V2_Color;                                                   // 0x0080   (0x0010)  
};

/// Struct /Script/Engine.ExponentialHeightFogData
/// Size: 0x000C (0x000000 - 0x00000C)
struct FExponentialHeightFogData
{ 
	float                                              FogDensity;                                                 // 0x0000   (0x0004)  
	float                                              FogHeightFalloff;                                           // 0x0004   (0x0004)  
	float                                              FogHeightOffset;                                            // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.FontImportOptionsData
/// Size: 0x00B0 (0x000000 - 0x0000B0)
struct FFontImportOptionsData
{ 
	FString                                            FontName;                                                   // 0x0000   (0x0010)  
	float                                              Height;                                                     // 0x0010   (0x0004)  
	bool                                               bEnableAntialiasing : 1;                                    // 0x0014:0 (0x0001)  
	bool                                               bEnableBold : 1;                                            // 0x0014:1 (0x0001)  
	bool                                               bEnableItalic : 1;                                          // 0x0014:2 (0x0001)  
	bool                                               bEnableUnderline : 1;                                       // 0x0014:3 (0x0001)  
	bool                                               bAlphaOnly : 1;                                             // 0x0014:4 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0015   (0x0003)  MISSED
	TEnumAsByte<EFontImportCharacterSet>               CharacterSet;                                               // 0x0018   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0019   (0x0007)  MISSED
	FString                                            Chars;                                                      // 0x0020   (0x0010)  
	FString                                            UnicodeRange;                                               // 0x0030   (0x0010)  
	FString                                            CharsFilePath;                                              // 0x0040   (0x0010)  
	FString                                            CharsFileWildcard;                                          // 0x0050   (0x0010)  
	bool                                               bCreatePrintableOnly : 1;                                   // 0x0060:0 (0x0001)  
	bool                                               bIncludeASCIIRange : 1;                                     // 0x0060:1 (0x0001)  
	unsigned char                                      UnknownData02_4[0x3];                                       // 0x0061   (0x0003)  MISSED
	FLinearColor                                       ForegroundColor;                                            // 0x0064   (0x0010)  
	bool                                               bEnableDropShadow : 1;                                      // 0x0074:0 (0x0001)  
	unsigned char                                      UnknownData03_4[0x3];                                       // 0x0075   (0x0003)  MISSED
	int32_t                                            TexturePageWidth;                                           // 0x0078   (0x0004)  
	int32_t                                            TexturePageMaxHeight;                                       // 0x007C   (0x0004)  
	int32_t                                            XPadding;                                                   // 0x0080   (0x0004)  
	int32_t                                            YPadding;                                                   // 0x0084   (0x0004)  
	int32_t                                            ExtendBoxTop;                                               // 0x0088   (0x0004)  
	int32_t                                            ExtendBoxBottom;                                            // 0x008C   (0x0004)  
	int32_t                                            ExtendBoxRight;                                             // 0x0090   (0x0004)  
	int32_t                                            ExtendBoxLeft;                                              // 0x0094   (0x0004)  
	bool                                               bEnableLegacyMode : 1;                                      // 0x0098:0 (0x0001)  
	unsigned char                                      UnknownData04_4[0x3];                                       // 0x0099   (0x0003)  MISSED
	int32_t                                            Kerning;                                                    // 0x009C   (0x0004)  
	bool                                               bUseDistanceFieldAlpha : 1;                                 // 0x00A0:0 (0x0001)  
	unsigned char                                      UnknownData05_4[0x3];                                       // 0x00A1   (0x0003)  MISSED
	int32_t                                            DistanceFieldScaleFactor;                                   // 0x00A4   (0x0004)  
	float                                              DistanceFieldScanRadiusScale;                               // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData06_6[0x4];                                       // 0x00AC   (0x0004)  MISSED
};

/// Struct /Script/Engine.BaseAttenuationSettings
/// Size: 0x00C0 (0x000000 - 0x0000C0)
struct FBaseAttenuationSettings
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
	EAttenuationDistanceModel                          DistanceAlgorithm;                                          // 0x0008   (0x0001)  
	TEnumAsByte<EAttenuationShape>                     AttenuationShape;                                           // 0x0009   (0x0001)  
	ENaturalSoundFalloffMode                           FalloffMode;                                                // 0x000A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x000B   (0x0001)  MISSED
	float                                              dBAttenuationAtMax;                                         // 0x000C   (0x0004)  
	FVector                                            AttenuationShapeExtents;                                    // 0x0010   (0x0018)  
	float                                              ConeOffset;                                                 // 0x0028   (0x0004)  
	float                                              FalloffDistance;                                            // 0x002C   (0x0004)  
	float                                              ConeSphereRadius;                                           // 0x0030   (0x0004)  
	float                                              ConeSphereFalloffDistance;                                  // 0x0034   (0x0004)  
	FRuntimeFloatCurve                                 CustomAttenuationCurve;                                     // 0x0038   (0x0088)  
};

/// Struct /Script/Engine.ForceFeedbackAttenuationSettings
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
struct FForceFeedbackAttenuationSettings : FBaseAttenuationSettings
{ 
};

/// Struct /Script/Engine.PredictProjectilePathParams
/// Size: 0x0078 (0x000000 - 0x000078)
struct FPredictProjectilePathParams
{ 
	FVector                                            StartLocation;                                              // 0x0000   (0x0018)  
	FVector                                            LaunchVelocity;                                             // 0x0018   (0x0018)  
	bool                                               bTraceWithCollision;                                        // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              ProjectileRadius;                                           // 0x0034   (0x0004)  
	float                                              MaxSimTime;                                                 // 0x0038   (0x0004)  
	bool                                               bTraceWithChannel;                                          // 0x003C   (0x0001)  
	TEnumAsByte<ECollisionChannel>                     TraceChannel;                                               // 0x003D   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x003E   (0x0002)  MISSED
	TArray<TEnumAsByte>                                ObjectTypes;                                                // 0x0040   (0x0010)  
	TArray<AActor*>                                    ActorsToIgnore;                                             // 0x0050   (0x0010)  
	float                                              SimFrequency;                                               // 0x0060   (0x0004)  
	float                                              OverrideGravityZ;                                           // 0x0064   (0x0004)  
	TEnumAsByte<EDrawDebugTrace>                       DrawDebugType;                                              // 0x0068   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0069   (0x0003)  MISSED
	float                                              DrawDebugTime;                                              // 0x006C   (0x0004)  
	bool                                               bTraceComplex;                                              // 0x0070   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Struct /Script/Engine.PredictProjectilePathPointData
/// Size: 0x0038 (0x000000 - 0x000038)
struct FPredictProjectilePathPointData
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	FVector                                            Velocity;                                                   // 0x0018   (0x0018)  
	float                                              Time;                                                       // 0x0030   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/Engine.PredictProjectilePathResult
/// Size: 0x0130 (0x000000 - 0x000130)
struct FPredictProjectilePathResult
{ 
	TArray<FPredictProjectilePathPointData>            PathData;                                                   // 0x0000   (0x0010)  
	FPredictProjectilePathPointData                    LastTraceDestination;                                       // 0x0010   (0x0038)  
	FHitResult                                         HitResult;                                                  // 0x0048   (0x00E8)  
};

/// Struct /Script/Engine.ActiveHapticFeedbackEffect
/// Size: 0x0048 (0x000000 - 0x000048)
struct FActiveHapticFeedbackEffect
{ 
	UHapticFeedbackEffect_Base*                        HapticEffect;                                               // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x40];                                      // 0x0008   (0x0040)  MISSED
};

/// Struct /Script/Engine.HapticFeedbackDetails_Curve
/// Size: 0x0110 (0x000000 - 0x000110)
struct FHapticFeedbackDetails_Curve
{ 
	FRuntimeFloatCurve                                 Frequency;                                                  // 0x0000   (0x0088)  
	FRuntimeFloatCurve                                 Amplitude;                                                  // 0x0088   (0x0088)  
};

/// Struct /Script/Engine.ClusterNode_DEPRECATED
/// Size: 0x0028 (0x000000 - 0x000028)
struct FClusterNode_DEPRECATED
{ 
	FVector3f                                          BoundMin;                                                   // 0x0000   (0x000C)  
	int32_t                                            FirstChild;                                                 // 0x000C   (0x0004)  
	FVector3f                                          BoundMax;                                                   // 0x0010   (0x000C)  
	int32_t                                            LastChild;                                                  // 0x001C   (0x0004)  
	int32_t                                            FirstInstance;                                              // 0x0020   (0x0004)  
	int32_t                                            LastInstance;                                               // 0x0024   (0x0004)  
};

/// Struct /Script/Engine.ClusterNode
/// Size: 0x0040 (0x000000 - 0x000040)
struct FClusterNode
{ 
	FVector3f                                          BoundMin;                                                   // 0x0000   (0x000C)  
	int32_t                                            FirstChild;                                                 // 0x000C   (0x0004)  
	FVector3f                                          BoundMax;                                                   // 0x0010   (0x000C)  
	int32_t                                            LastChild;                                                  // 0x001C   (0x0004)  
	int32_t                                            FirstInstance;                                              // 0x0020   (0x0004)  
	int32_t                                            LastInstance;                                               // 0x0024   (0x0004)  
	FVector3f                                          MinInstanceScale;                                           // 0x0028   (0x000C)  
	FVector3f                                          MaxInstanceScale;                                           // 0x0034   (0x000C)  
};

/// Struct /Script/Engine.HLODSubActorDesc
/// Size: 0x0001 (0x000000 - 0x000001)
struct FHLODSubActorDesc
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.HLODSubActor
/// Size: 0x0001 (0x000000 - 0x000001)
struct FHLODSubActor
{ 
	unsigned char                                      UnknownData00_1[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Engine.InstancedStaticMeshInstanceData
/// Size: 0x0080 (0x000000 - 0x000080)
struct FInstancedStaticMeshInstanceData
{ 
	FMatrix                                            Transform;                                                  // 0x0000   (0x0080)  
};

/// Struct /Script/Engine.InstancedStaticMeshMappingInfo
/// Size: 0x0008 (0x000000 - 0x000008)
struct FInstancedStaticMeshMappingInfo
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/Engine.InstancedStaticMeshRandomSeed
/// Size: 0x0008 (0x000000 - 0x000008)
struct FInstancedStaticMeshRandomSeed
{ 
	int32_t                                            StartInstanceIndex;                                         // 0x0000   (0x0004)  
	int32_t                                            RandomSeed;                                                 // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.InstancedStaticMeshLightMapInstanceData
/// Size: 0x0070 (0x000000 - 0x000070)
struct FInstancedStaticMeshLightMapInstanceData
{ 
	FTransform                                         Transform;                                                  // 0x0000   (0x0060)  
	TArray<FGuid>                                      MapBuildDataIds;                                            // 0x0060   (0x0010)  
};

/// Struct /Script/Engine.InstancedStaticMeshComponentInstanceData
/// Size: 0x00D8 (0x0000B8 - 0x000190)
struct FInstancedStaticMeshComponentInstanceData : FSceneComponentInstanceData
{ 
	UStaticMesh*                                       StaticMesh;                                                 // 0x00B8   (0x0008)  
	FInstancedStaticMeshLightMapInstanceData           CachedStaticLighting;                                       // 0x00C0   (0x0070)  
	TArray<FInstancedStaticMeshInstanceData>           PerInstanceSMData;                                          // 0x0130   (0x0010)  
	TArray<float>                                      PerInstanceSMCustomData;                                    // 0x0140   (0x0010)  
	unsigned char                                      UnknownData00_5[0x20];                                      // 0x0150   (0x0020)  MISSED
	int32_t                                            InstancingRandomSeed;                                       // 0x0170   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0174   (0x0004)  MISSED
	TArray<FInstancedStaticMeshRandomSeed>             AdditionalRandomSeeds;                                      // 0x0178   (0x0010)  
	bool                                               bHasPerInstanceHitProxies;                                  // 0x0188   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0189   (0x0007)  MISSED
};

/// Struct /Script/Engine.UniqueNetIdReplNetSerializerStringStruct
/// Size: 0x0010 (0x000000 - 0x000010)
struct FUniqueNetIdReplNetSerializerStringStruct
{ 
	FString                                            String;                                                     // 0x0000   (0x0010)  
};

/// Struct /Script/Engine.UniqueNetIdReplNetSerializerNameStruct
/// Size: 0x0008 (0x000000 - 0x000008)
struct FUniqueNetIdReplNetSerializerNameStruct
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.ISMClientHandle
/// Size: 0x0014 (0x000000 - 0x000014)
struct FISMClientHandle
{ 
	int32_t                                            Index;                                                      // 0x0000   (0x0004)  
	FGuid                                              Guid;                                                       // 0x0004   (0x0010)  
};

/// Struct /Script/Engine.ISMClientInstanceManagerData
/// Size: 0x0010 (0x000000 - 0x000010)
struct FISMClientInstanceManagerData
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Engine.NewLevelInstanceParams
/// Size: 0x0048 (0x000000 - 0x000048)
struct FNewLevelInstanceParams
{ 
	ELevelInstanceCreationType                         Type;                                                       // 0x0000   (0x0001)  
	ELevelInstancePivotType                            PivotType;                                                  // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0002   (0x0006)  MISSED
	AActor*                                            PivotActor;                                                 // 0x0008   (0x0008)  
	bool                                               bAlwaysShowDialog;                                          // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0011   (0x0007)  MISSED
	UWorld*                                            TemplateWorld;                                              // 0x0018   (0x0008)  
	FString                                            LevelPackageName;                                           // 0x0020   (0x0010)  
	bool                                               bPromptForSave;                                             // 0x0030   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	UClass*                                            LevelInstanceClass;                                         // 0x0038   (0x0008)  
	bool                                               bExternalActors;                                            // 0x0040   (0x0001)  
	bool                                               bForceExternalActors;                                       // 0x0041   (0x0001)  
	bool                                               bHideCreationType;                                          // 0x0042   (0x0001)  
	unsigned char                                      UnknownData03_6[0x5];                                       // 0x0043   (0x0005)  MISSED
};

/// Struct /Script/Engine.ParameterGroupData
/// Size: 0x0018 (0x000000 - 0x000018)
struct FParameterGroupData
{ 
	FString                                            GroupName;                                                  // 0x0000   (0x0010)  
	int32_t                                            GroupSortPriority;                                          // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Engine.ExpressionExecOutput
/// Size: 0x0008 (0x000000 - 0x000008)
struct FExpressionExecOutput
{ 
	UMaterialExpression*                               Expression;                                                 // 0x0000   (0x0008)  
};

/// Struct /Script/Engine.MaterialExpressionCollection
/// Size: 0x0030 (0x000000 - 0x000030)
struct FMaterialExpressionCollection
{ 
	TArray<UMaterialExpression*>                       Expressions;                                                // 0x0000   (0x0010)  
	TArray<UMaterialExpressionComment*>                EditorComments;                                             // 0x0010   (0x0010)  
	UMaterialExpressionExecBegin*                      ExpressionExecBegin;                                        // 0x0020   (0x0008)  
	UMaterialExpressionExecEnd*                        ExpressionExecEnd;                                          // 0x0028   (0x0008)  
};

/// Struct /Script/Engine.CustomInput
/// Size: 0x0030 (0x000000 - 0x000030)
struct FCustomInput
{ 
	FName                                              InputName;                                                  // 0x0000   (0x0008)  
	FExpressionInput                                   Input;                                                      // 0x0008   (0x0028)  
};

/// Struct /Script/Engine.CustomOutput
/// Size: 0x000C (0x000000 - 0x00000C)
struct FCustomOutput
{ 
	FName                                              OutputName;                                                 // 0x0000   (0x0008)  
	TEnumAsByte<ECustomMaterialOutputType>             OutputType;                                                 // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
};

/// Struct /Script/Engine.CustomDefine
/// Size: 0x0020 (0x000000 - 0x000020)
struct FCustomDefine
{ 
	FString                                            DefineName;                                                 // 0x0000   (0x0010)  
	FString                                            DefineValue;                                                // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.FunctionExpressionInput
/// Size: 0x0040 (0x000000 - 0x000040)
struct FFunctionExpressionInput
{ 
	UMaterialExpressionFunctionInput*                  ExpressionInput;                                            // 0x0000   (0x0008)  
	FGuid                                              ExpressionInputId;                                          // 0x0008   (0x0010)  
	FExpressionInput                                   Input;                                                      // 0x0018   (0x0028)  
};

/// Struct /Script/Engine.FunctionExpressionOutput
/// Size: 0x0038 (0x000000 - 0x000038)
struct FFunctionExpressionOutput
{ 
	UMaterialExpressionFunctionOutput*                 ExpressionOutput;                                           // 0x0000   (0x0008)  
	FGuid                                              ExpressionOutputId;                                         // 0x0008   (0x0010)  
	FExpressionOutput                                  Output;                                                     // 0x0018   (0x001C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/Engine.CompositeReroute
/// Size: 0x0010 (0x000000 - 0x000010)
struct FCompositeReroute
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
	UMaterialExpressionReroute*                        Expression;                                                 // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.MaterialInstanceBasePropertyOverrides
/// Size: 0x0008 (0x000000 - 0x000008)
struct FMaterialInstanceBasePropertyOverrides
{ 
	bool                                               bOverride_OpacityMaskClipValue : 1;                         // 0x0000:0 (0x0001)  
	bool                                               bOverride_BlendMode : 1;                                    // 0x0000:1 (0x0001)  
	bool                                               bOverride_ShadingModel : 1;                                 // 0x0000:2 (0x0001)  
	bool                                               bOverride_DitheredLODTransition : 1;                        // 0x0000:3 (0x0001)  
	bool                                               bOverride_CastDynamicShadowAsMasked : 1;                    // 0x0000:4 (0x0001)  
	bool                                               bOverride_TwoSided : 1;                                     // 0x0000:5 (0x0001)  
	bool                                               bOverride_OutputTranslucentVelocity : 1;                    // 0x0000:6 (0x0001)  
	bool                                               TwoSided : 1;                                               // 0x0000:7 (0x0001)  
	bool                                               DitheredLODTransition : 1;                                  // 0x0001:0 (0x0001)  
	bool                                               bCastDynamicShadowAsMasked : 1;                             // 0x0001:1 (0x0001)  
	bool                                               bOutputTranslucentVelocity : 1;                             // 0x0001:2 (0x0001)  
	TEnumAsByte<EBlendMode>                            BlendMode;                                                  // 0x0002   (0x0001)  
	TEnumAsByte<EMaterialShadingModel>                 ShadingModel;                                               // 0x0003   (0x0001)  
	float                                              OpacityMaskClipValue;                                       // 0x0004   (0x0004)  
};

/// Struct /Script/Engine.LightmassMaterialInterfaceSettings
/// Size: 0x0010 (0x000000 - 0x000010)
struct FLightmassMaterialInterfaceSettings
{ 
	float                                              EmissiveBoost;                                              // 0x0000   (0x0004)  
	float                                              DiffuseBoost;                                               // 0x0004   (0x0004)  
	float                                              ExportResolutionScale;                                      // 0x0008   (0x0004)  
	bool                                               bCastShadowAsMasked : 1;                                    // 0x000C:0 (0x0001)  
	bool                                               bOverrideCastShadowAsMasked : 1;                            // 0x000C:1 (0x0001)  
	bool                                               bOverrideEmissiveBoost : 1;                                 // 0x000C:2 (0x0001)  
	bool                                               bOverrideDiffuseBoost : 1;                                  // 0x000C:3 (0x0001)  
	bool                                               bOverrideExportResolutionScale : 1;                         // 0x000C:4 (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x000D   (0x0003)  MISSED
};

/// Struct /Script/Engine.MaterialTextureInfo
/// Size: 0x0010 (0x000000 - 0x000010)
struct FMaterialTextureInfo
{ 
	float                                              SamplingScale;                                              // 0x0000   (0x0004)  
	int32_t                                            UVChannelIndex;                                             // 0x0004   (0x0004)  
	FName                                              TextureName;                                                // 0x0008   (0x0008)  
};

/// Struct /Script/Engine.MaterialLayersFunctionsEditorOnlyData
/// Size: 0x0070 (0x000000 - 0x000070)
struct FMaterialLayersFunctionsEditorOnlyData
{ 
	TArray<bool>                                       LayerStates;                                                // 0x0000   (0x0010)  
	TArray<FText>                                      LayerNames;                                                 // 0x0010   (0x0010)  
	TArray<bool>                                       RestrictToLayerRelatives;                                   // 0x0020   (0x0010)  
	TArray<bool>                                       RestrictToBlendRelatives;                                   // 0x0030   (0x0010)  
	TArray<FGuid>                                      LayerGuids;                                                 // 0x0040   (0x0010)  
	TArray<EMaterialLayerLinkState>                    LayerLinkStates;                                            // 0x0050   (0x0010)  
	TArray<FGuid>                                      DeletedParentLayerGuids;                                    // 0x0060   (0x0010)  
};

/// Struct /Script/Engine.MaterialLayersFunctionsRuntimeData
/// Size: 0x0020 (0x000000 - 0x000020)
struct FMaterialLayersFunctionsRuntimeData
{ 
	TArray<UMaterialFunctionInterface*>                Layers;                                                     // 0x0000   (0x0010)  
	TArray<UMaterialFunctionInterface*>                Blends;                                                     // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.MaterialLayersFunctions
/// Size: 0x00E0 (0x000020 - 0x000100)
struct FMaterialLayersFunctions : FMaterialLayersFunctionsRuntimeData
{ 
	FMaterialLayersFunctionsEditorOnlyData             EditorOnly;                                                 // 0x0020   (0x0070)  
	TArray<bool>                                       LayerStates;                                                // 0x0090   (0x0010)  
	TArray<FText>                                      LayerNames;                                                 // 0x00A0   (0x0010)  
	TArray<bool>                                       RestrictToLayerRelatives;                                   // 0x00B0   (0x0010)  
	TArray<bool>                                       RestrictToBlendRelatives;                                   // 0x00C0   (0x0010)  
	TArray<FGuid>                                      LayerGuids;                                                 // 0x00D0   (0x0010)  
	TArray<EMaterialLayerLinkState>                    LayerLinkStates;                                            // 0x00E0   (0x0010)  
	TArray<FGuid>                                      DeletedParentLayerGuids;                                    // 0x00F0   (0x0010)  
};

/// Struct /Script/Engine.MaterialProxySettings
/// Size: 0x0094 (0x000000 - 0x000094)
struct FMaterialProxySettings
{ 
	TEnumAsByte<ETextureSizingType>                    TextureSizingType;                                          // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	FIntPoint                                          TextureSize;                                                // 0x0004   (0x0008)  
	float                                              TargetTexelDensityPerMeter;                                 // 0x000C   (0x0004)  
	float                                              MeshMaxScreenSizePercent;                                   // 0x0010   (0x0004)  
	float                                              MeshMinDrawDistance;                                        // 0x0014   (0x0004)  
	float                                              GutterSpace;                                                // 0x0018   (0x0004)  
	float                                              MetallicConstant;                                           // 0x001C   (0x0004)  
	float                                              RoughnessConstant;                                          // 0x0020   (0x0004)  
	float                                              AnisotropyConstant;                                         // 0x0024   (0x0004)  
	float                                              SpecularConstant;                                           // 0x0028   (0x0004)  
	float                                              OpacityConstant;                                            // 0x002C   (0x0004)  
	float                                              OpacityMaskConstant;                                        // 0x0030   (0x0004)  
	float                                              AmbientOcclusionConstant;                                   // 0x0034   (0x0004)  
	TEnumAsByte<EMaterialMergeType>                    MaterialMergeType;                                          // 0x0038   (0x0001)  
	TEnumAsByte<EBlendMode>                            BlendMode;                                                  // 0x0039   (0x0001)  
	bool                                               bAllowTwoSidedMaterial : 1;                                 // 0x003A:0 (0x0001)  
	bool                                               bNormalMap : 1;                                             // 0x003A:1 (0x0001)  
	bool                                               bTangentMap : 1;                                            // 0x003A:2 (0x0001)  
	bool                                               bMetallicMap : 1;                                           // 0x003A:3 (0x0001)  
	bool                                               bRoughnessMap : 1;                                          // 0x003A:4 (0x0001)  
	bool                                               bAnisotropyMap : 1;                                         // 0x003A:5 (0x0001)  
	bool                                               bSpecularMap : 1;                                           // 0x003A:6 (0x0001)  
	bool                                               bEmissiveMap : 1;                                           // 0x003A:7 (0x0001)  
	bool                                               bOpacityMap : 1;                                            // 0x003B:0 (0x0001)  
	bool                                               bOpacityMaskMap : 1;                                        // 0x003B:1 (0x0001)  
	bool                                               bAmbientOcclusionMap : 1;                                   // 0x003B:2 (0x0001)  
	FIntPoint                                          DiffuseTextureSize;                                         // 0x003C   (0x0008)  
	FIntPoint                                          NormalTextureSize;                                          // 0x0044   (0x0008)  
	FIntPoint                                          TangentTextureSize;                                         // 0x004C   (0x0008)  
	FIntPoint                                          MetallicTextureSize;                                        // 0x0054   (0x0008)  
	FIntPoint                                          RoughnessTextureSize;                                       // 0x005C   (0x0008)  
	FIntPoint                                          AnisotropyTextureSize;                                      // 0x0064   (0x0008)  
	FIntPoint                                          SpecularTextureSize;                                        // 0x006C   (0x0008)  
	FIntPoint                                          EmissiveTextureSize;                                        // 0x0074   (0x0008)  
	FIntPoint                                          OpacityTextureSize;                                         // 0x007C   (0x0008)  
	FIntPoint                                          OpacityMaskTextureSize;                                     // 0x0084   (0x0008)  
	FIntPoint                                          AmbientOcclusionTextureSize;                                // 0x008C   (0x0008)  
};

/// Struct /Script/Engine.MaterialOverrideNanite
/// Size: 0x0040 (0x000000 - 0x000040)
struct FMaterialOverrideNanite
{ 
	TWeakObjectPtr<UMaterialInterface*>                OverrideMaterialRef;                                        // 0x0000   (0x0030)  
	bool                                               bEnableOverride;                                            // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	UMaterialInterface*                                OverrideMaterial;                                           // 0x0038   (0x0008)  
};

/// Struct /Script/Engine.CollectionParameterBase
/// Size: 0x0018 (0x000000 - 0x000018)
struct FCollectionParameterBase
{ 
	FName                                              ParameterName;                                              // 0x0000   (0x0008)  
	FGuid                                              ID;                                                         // 0x0008   (0x0010)  
};

/// Struct /Script/Engine.CollectionScalarParameter
/// Size: 0x0004 (0x000018 - 0x00001C)
struct FCollectionScalarParameter : FCollectionParameterBase
{ 
	float                                              DefaultValue;                                               // 0x0018   (0x0004)  
};

/// Struct /Script/Engine.CollectionVectorParameter
/// Size: 0x0010 (0x000018 - 0x000028)
struct FCollectionVectorParameter : FCollectionParameterBase
{ 
	FLinearColor                                       DefaultValue;                                               // 0x0018   (0x0010)  
};

/// Struct /Script/Engine.MaterialParameterInfo
/// Size: 0x0010 (0x000000 - 0x000010)
struct FMaterialParameterInfo
{ 
	FName                                              Name;                                                       // 0x0000   (0x0008)  
	TEnumAsByte<EMaterialParameterAssociation>         Association;                                                // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            Index;                                                      // 0x000C   (0x0004)  
};

/// Struct /Script/Engine.ParameterChannelNames
/// Size: 0x0060 (0x000000 - 0x000060)
struct FParameterChannelNames
{ 
	FText                                              R;                                                          // 0x0000   (0x0018)  
	FText                                              G;                                                          // 0x0018   (0x0018)  
	FText                                              B;                                                          // 0x0030   (0x0018)  
	FText                                              A;                                                          // 0x0048   (0x0018)  
};

/// Struct /Script/Engine.StaticComponentMaskValue
/// Size: 0x0004 (0x000000 - 0x000004)
struct FStaticComponentMaskValue
{ 
	bool                                               R;                                                          // 0x0000   (0x0001)  
	bool                                               G;                                                          // 0x0001   (0x0001)  
	bool                                               B;                                                          // 0x0002   (0x0001)  
	bool                                               A;                                                          // 0x0003   (0x0001)  
};

/// Struct /Script/Engine.PurchaseInfo
/// Size: 0x0040 (0x000000 - 0x000040)
struct FPurchaseInfo
{ 
	FString                                            Identifier;                                                 // 0x0000   (0x0010)  
	FString                                            DisplayName;                                                // 0x0010   (0x0010)  
	FString                                            DisplayDescription;                                         // 0x0020   (0x0010)  
	FString                                            DisplayPrice;                                               // 0x0030   (0x0010)  
};

/// Struct /Script/Engine.NavAvoidanceMask
/// Size: 0x0004 (0x000000 - 0x000004)
struct FNavAvoidanceMask
{ 
	bool                                               bGroup0 : 1;                                                // 0x0000:0 (0x0001)  
	bool                                               bGroup1 : 1;                                                // 0x0000:1 (0x0001)  
	bool                                               bGroup2 : 1;                                                // 0x0000:2 (0x0001)  
	bool                                               bGroup3 : 1;                                                // 0x0000:3 (0x0001)  
	bool                                               bGroup4 : 1;                                                // 0x0000:4 (0x0001)  
	bool                                               bGroup5 : 1;                                                // 0x0000:5 (0x0001)  
	bool                                               bGroup6 : 1;                                                // 0x0000:6 (0x0001)  
	bool                                               bGroup7 : 1;                                                // 0x0000:7 (0x0001)  
	bool                                               bGroup8 : 1;                                                // 0x0001:0 (0x0001)  
	bool                                               bGroup9 : 1;                                                // 0x0001:1 (0x0001)  
	bool                                               bGroup10 : 1;                                               // 0x0001:2 (0x0001)  
	bool                                               bGroup11 : 1;                                               // 0x0001:3 (0x0001)  
	bool                                               bGroup12 : 1;                                               // 0x0001:4 (0x0001)  
	bool                                               bGroup13 : 1;                                               // 0x0001:5 (0x0001)  
	bool                                               bGroup14 : 1;                                               // 0x0001:6 (0x0001)  
	bool                                               bGroup15 : 1;                                               // 0x0001:7 (0x0001)  
	bool                                               bGroup16 : 1;                                               // 0x0002:0 (0x0001)  
	bool                                               bGroup17 : 1;                                               // 0x0002:1 (0x0001)  
	bool                                               bGroup18 : 1;                                               // 0x0002:2 (0x0001)  
	bool                                               bGroup19 : 1;                                               // 0x0002:3 (0x0001)  
	bool                                               bGroup20 : 1;                                               // 0x0002:4 (0x0001)  
	bool                                               bGroup21 : 1;                                               // 0x0002:5 (0x0001)  
	bool                                               bGroup22 : 1;                                               // 0x0002:6 (0x0001)  
	bool                                               bGroup23 : 1;                                               // 0x0002:7 (0x0001)  
	bool                                               bGroup24 : 1;                                               // 0x0003:0 (0x0001)  
	bool                                               bGroup25 : 1;                                               // 0x0003:1 (0x0001)  
	bool                                               bGroup26 : 1;                                               // 0x0003:2 (0x0001)  
	bool                                               bGroup27 : 1;                                               // 0x0003:3 (0x0001)  
	bool                                               bGroup28 : 1;                                               // 0x0003:4 (0x0001)  
	bool                                               bGroup29 : 1;                                               // 0x0003:5 (0x0001)  
	bool                                               bGroup30 : 1;                                               // 0x0003:6 (0x0001)  
	bool                                               bGroup31 : 1;                                               // 0x0003:7 (0x0001)  
};

/// Struct /Script/Engine.NavigationLinkBase
/// Size: 0x0030 (0x000000 - 0x000030)
struct FNavigationLinkBase
{ 
	float                                              LeftProjectHeight;                                          // 0x0000   (0x0004)  
	float                                              MaxFallDownLength;                                          // 0x0004   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0008   (0x0004)  MISSED
	float                                              SnapRadius;                                                 // 0x000C   (0x0004)  
	float                                              SnapHeight;                                                 // 0x0010   (0x0004)  
	FNavAgentSelector                                  SupportedAgents;                                            // 0x0014   (0x0004)  
	bool                                               bSupportsAgent0 : 1;                                        // 0x0018:0 (0x0001)  
	bool                                               bSupportsAgent1 : 1;                                        // 0x0018:1 (0x0001)  
	bool                                               bSupportsAgent2 : 1;                                        // 0x0018:2 (0x0001)  
	bool                                               bSupportsAgent3 : 1;                                        // 0x0018:3 (0x0001)  
	bool                                               bSupportsAgent4 : 1;                                        // 0x0018:4 (0x0001)  
	bool                                               bSupportsAgent5 : 1;                                        // 0x0018:5 (0x0001)  
	bool                                               bSupportsAgent6 : 1;                                        // 0x0018:6 (0x0001)  
	bool                                               bSupportsAgent7 : 1;                                        // 0x0018:7 (0x0001)  
	bool                                               bSupportsAgent8 : 1;                                        // 0x0019:0 (0x0001)  
	bool                                               bSupportsAgent9 : 1;                                        // 0x0019:1 (0x0001)  
	bool                                               bSupportsAgent10 : 1;                                       // 0x0019:2 (0x0001)  
	bool                                               bSupportsAgent11 : 1;                                       // 0x0019:3 (0x0001)  
	bool                                               bSupportsAgent12 : 1;                                       // 0x0019:4 (0x0001)  
	bool                                               bSupportsAgent13 : 1;                                       // 0x0019:5 (0x0001)  
	bool                                               bSupportsAgent14 : 1;                                       // 0x0019:6 (0x0001)  
	bool                                               bSupportsAgent15 : 1;                                       // 0x0019:7 (0x0001)  
	unsigned char                                      UnknownData01_4[0x2];                                       // 0x001A   (0x0002)  MISSED
	TEnumAsByte<ENavLinkDirection>                     Direction;                                                  // 0x001C   (0x0001)  
	bool                                               bUseSnapHeight : 1;                                         // 0x001D:0 (0x0001)  
	bool                                               bSnapToCheapestArea : 1;                                    // 0x001D:1 (0x0001)  
	bool                                               bCustomFlag0 : 1;                                           // 0x001D:2 (0x0001)  
	bool                                               bCustomFlag1 : 1;                                           // 0x001D:3 (0x0001)  
	bool                                               bCustomFlag2 : 1;                                           // 0x001D:4 (0x0001)  
	bool                                               bCustomFlag3 : 1;                                           // 0x001D:5 (0x0001)  
	bool                                               bCustomFlag4 : 1;                                           // 0x001D:6 (0x0001)  
	bool                                               bCustomFlag5 : 1;                                           // 0x001D:7 (0x0001)  
	bool                                               bCustomFlag6 : 1;                                           // 0x001E:0 (0x0001)  
	bool                                               bCustomFlag7 : 1;                                           // 0x001E:1 (0x0001)  
	unsigned char                                      UnknownData02_4[0x1];                                       // 0x001F   (0x0001)  MISSED
	UClass*                                            AreaClass;                                                  // 0x0020   (0x0008)  
	unsigned char                                      UnknownData03_6[0x8];                                       // 0x0028   (0x0008)  MISSED
};

/// Struct /Script/Engine.NavAgentSelector
/// Size: 0x0004 (0x000000 - 0x000004)
struct FNavAgentSelector
{ 
	bool                                               bSupportsAgent0 : 1;                                        // 0x0000:0 (0x0001)  
	bool                                               bSupportsAgent1 : 1;                                        // 0x0000:1 (0x0001)  
	bool                                               bSupportsAgent2 : 1;                                        // 0x0000:2 (0x0001)  
	bool                                               bSupportsAgent3 : 1;                                        // 0x0000:3 (0x0001)  
	bool                                               bSupportsAgent4 : 1;                                        // 0x0000:4 (0x0001)  
	bool                                               bSupportsAgent5 : 1;                                        // 0x0000:5 (0x0001)  
	bool                                               bSupportsAgent6 : 1;                                        // 0x0000:6 (0x0001)  
	bool                                               bSupportsAgent7 : 1;                                        // 0x0000:7 (0x0001)  
	bool                                               bSupportsAgent8 : 1;                                        // 0x0001:0 (0x0001)  
	bool                                               bSupportsAgent9 : 1;                                        // 0x0001:1 (0x0001)  
	bool                                               bSupportsAgent10 : 1;                                       // 0x0001:2 (0x0001)  
	bool                                               bSupportsAgent11 : 1;                                       // 0x0001:3 (0x0001)  
	bool                                               bSupportsAgent12 : 1;                                       // 0x0001:4 (0x0001)  
	bool                                               bSupportsAgent13 : 1;                                       // 0x0001:5 (0x0001)  
	bool                                               bSupportsAgent14 : 1;                                       // 0x0001:6 (0x0001)  
	bool                                               bSupportsAgent15 : 1;                                       // 0x0001:7 (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0002   (0x0002)  MISSED
};

/// Struct /Script/Engine.NavigationLink
/// Size: 0x0030 (0x000030 - 0x000060)
struct FNavigationLink : FNavigationLinkBase
{ 
	FVector                                            Left;                                                       // 0x0030   (0x0018)  
	FVector                                            Right;                                                      // 0x0048   (0x0018)  
};

/// Struct /Script/Engine.NavigationSegmentLink
/// Size: 0x0060 (0x000030 - 0x000090)
struct FNavigationSegmentLink : FNavigationLinkBase
{ 
	FVector                                            LeftStart;                                                  // 0x0030   (0x0018)  
	FVector                                            LeftEnd;                                                    // 0x0048   (0x0018)  
	FVector                                            RightStart;                                                 // 0x0060   (0x0018)  
	FVector                                            RightEnd;                                                   // 0x0078   (0x0018)  
};

/// Struct /Script/Engine.OverlapResult
/// Size: 0x0028 (0x000000 - 0x000028)
struct FOverlapResult
{ 
	FActorInstanceHandle                               OverlapObjectHandle;                                        // 0x0000   (0x0018)  
	TWeakObjectPtr<UPrimitiveComponent*>               Component;                                                  // 0x0018   (0x0008)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0020   (0x0004)  MISSED
	bool                                               bBlockingHit : 1;                                           // 0x0024:0 (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0025   (0x0003)  MISSED
};

/// Struct /Script/Engine.ParticleBurst
/// Size: 0x000C (0x000000 - 0x00000C)
struct FParticleBurst
{ 
	int32_t                                            Count;                                                      // 0x0000   (0x0004)  
	int32_t                                            CountLow;                                                   // 0x0004   (0x0004)  
	float                                              Time;                                                       // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.ParticleCurvePair
/// Size: 0x0018 (0x000000 - 0x000018)
struct FParticleCurvePair
{ 
	FString                                            CurveName;                                                  // 0x0000   (0x0010)  
	UObject*                                           CurveObject;                                                // 0x0010   (0x0008)  
};

/// Struct /Script/Engine.ParticleRandomSeedInfo
/// Size: 0x0020 (0x000000 - 0x000020)
struct FParticleRandomSeedInfo
{ 
	FName                                              ParameterName;                                              // 0x0000   (0x0008)  
	bool                                               bGetSeedFromInstance : 1;                                   // 0x0008:0 (0x0001)  
	bool                                               bInstanceSeedIsIndex : 1;                                   // 0x0008:1 (0x0001)  
	bool                                               bResetSeedOnEmitterLooping : 1;                             // 0x0008:2 (0x0001)  
	bool                                               bRandomlySelectSeedArray : 1;                               // 0x0008:3 (0x0001)  
	unsigned char                                      UnknownData00_4[0x7];                                       // 0x0009   (0x0007)  MISSED
	TArray<int32_t>                                    RandomSeeds;                                                // 0x0010   (0x0010)  
};

/// Struct /Script/Engine.BeamModifierOptions
/// Size: 0x0004 (0x000000 - 0x000004)
struct FBeamModifierOptions
{ 
	bool                                               bModify : 1;                                                // 0x0000:0 (0x0001)  
	bool                                               bScale : 1;                                                 // 0x0000:1 (0x0001)  
	bool                                               Block : 1;                                                  // 0x0000:2 (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
};

/// Struct /Script/Engine.ParticleEvent_GenerateInfo
/// Size: 0x0028 (0x000000 - 0x000028)
struct FParticleEvent_GenerateInfo
{ 
	TEnumAsByte<EParticleEventType>                    Type;                                                       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Frequency;                                                  // 0x0004   (0x0004)  
	int32_t                                            ParticleFrequency;                                          // 0x0008   (0x0004)  
	bool                                               FirstTimeOnly : 1;                                          // 0x000C:0 (0x0001)  
	bool                                               LastTimeOnly : 1;                                           // 0x000C:1 (0x0001)  
	bool                                               UseReflectedImpactVector : 1;                               // 0x000C:2 (0x0001)  
	bool                                               bUseOrbitOffset : 1;                                        // 0x000C:3 (0x0001)  
	unsigned char                                      UnknownData01_4[0x3];                                       // 0x000D   (0x0003)  MISSED
	FName                                              CustomName;                                                 // 0x0010   (0x0008)  
	TArray<UParticleModuleEventSendToGame*>            ParticleModuleEventsToSendToGame;                           // 0x0018   (0x0010)  
};

/// Struct /Script/Engine.LocationBoneSocketInfo
/// Size: 0x0020 (0x000000 - 0x000020)
struct FLocationBoneSocketInfo
{ 
	FName                                              BoneSocketName;                                             // 0x0000   (0x0008)  
	FVector                                            Offset;                                                     // 0x0008   (0x0018)  
};

/// Struct /Script/Engine.OrbitOptions
/// Size: 0x0004 (0x000000 - 0x000004)
struct FOrbitOptions
{ 
	bool                                               bProcessDuringSpawn : 1;                                    // 0x0000:0 (0x0001)  
	bool                                               bProcessDuringUpdate : 1;                                   // 0x0000:1 (0x0001)  
	bool                                               bUseEmitterTime : 1;                                        // 0x0000:2 (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
};

/// Struct /Script/Engine.EmitterDynamicParameter
/// Size: 0x0048 (0x000000 - 0x000048)
struct FEmitterDynamicParameter
{ 
	FName                                              ParamName;                                                  // 0x0000   (0x0008)  
	bool                                               bUseEmitterTime : 1;                                        // 0x0008:0 (0x0001)  
	bool                                               bSpawnTimeOnly : 1;                                         // 0x0008:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0009   (0x0003)  MISSED
	TEnumAsByte<EEmitterDynamicParameterValue>         ValueMethod;                                                // 0x000C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x000D   (0x0003)  MISSED
	bool                                               bScaleVelocityByParamValue : 1;                             // 0x0010:0 (0x0001)  
	unsigned char                                      UnknownData02_4[0x7];                                       // 0x0011   (0x0007)  MISSED
	FRawDistributionFloat                              ParamValue;                                                 // 0x0018   (0x0030)  
};

/// Struct /Script/Engine.BeamTargetData
/// Size: 0x000C (0x000000 - 0x00000C)
struct FBeamTargetData
{ 
	FName                                              TargetName;                                                 // 0x0000   (0x0008)  
	float                                              TargetPercentage;                                           // 0x0008   (0x0004)  
};

/// Struct /Script/Engine.GPUSpriteLocalVectorFieldInfo
/// Size: 0x00D0 (0x000000 - 0x0000D0)
struct FGPUSpriteLocalVectorFieldInfo
{ 
	UVectorField*                                      Field;                                                      // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0008   (0x0008)  MISSED
	FTransform                                         Transform;                                                  // 0x0010   (0x0060)  
	FRotator                                           MinInitialRotation;                                         // 0x0070   (0x0018)  
	FRotator                                           MaxInitialRotation;                                         // 0x0088   (0x0018)  
	FRotator                                           RotationRate;                                               // 0x00A0   (0x0018)  
	float                                              Intensity;                                                  // 0x00B8   (0x0004)  
	float                                              Tightness;                                                  // 0x00BC   (0x0004)  
	bool                                               bIgnoreComponentTransform : 1;                              // 0x00C0:0 (0x0001)  
	bool                                               bTileX : 1;                                                 // 0x00C0:1 (0x0001)  
	bool                                               bTileY : 1;                                                 // 0x00C0:2 (0x0001)  
	bool                                               bTileZ : 1;                                                 // 0x00C0:3 (0x0001)  
	bool                                               bUseFixDT : 1;                                              // 0x00C0:4 (0x0001)  
	unsigned char                                      UnknownData01_6[0xF];                                       // 0x00C1   (0x000F)  MISSED
};

/// Struct /Script/Engine.GPUSpriteEmitterInfo
/// Size: 0x0350 (0x000000 - 0x000350)
struct FGPUSpriteEmitterInfo
{ 
	UParticleModuleRequired*                           RequiredModule;                                             // 0x0000   (0x0008)  
	UParticleModuleSpawn*                              SpawnModule;                                                // 0x0008   (0x0008)  
	UParticleModuleSpawnPerUnit*                       SpawnPerUnitModule;                                         // 0x0010   (0x0008)  
	TArray<UParticleModule*>                           SpawnModules;                                               // 0x0018   (0x0010)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0028   (0x0008)  MISSED
	FGPUSpriteLocalVectorFieldInfo                     LocalVectorField;                                           // 0x0030   (0x00D0)  
	FFloatDistribution                                 VectorFieldScale;                                           // 0x0100   (0x0020)  
	FFloatDistribution                                 DragCoefficient;                                            // 0x0120   (0x0020)  
	FFloatDistribution                                 PointAttractorStrength;                                     // 0x0140   (0x0020)  
	FFloatDistribution                                 Resilience;                                                 // 0x0160   (0x0020)  
	FVector                                            ConstantAcceleration;                                       // 0x0180   (0x0018)  
	FVector                                            PointAttractorPosition;                                     // 0x0198   (0x0018)  
	float                                              PointAttractorRadiusSq;                                     // 0x01B0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x01B4   (0x0004)  MISSED
	FVector                                            OrbitOffsetBase;                                            // 0x01B8   (0x0018)  
	FVector                                            OrbitOffsetRange;                                           // 0x01D0   (0x0018)  
	FVector2D                                          InvMaxSize;                                                 // 0x01E8   (0x0010)  
	float                                              InvRotationRateScale;                                       // 0x01F8   (0x0004)  
	float                                              MaxLifetime;                                                // 0x01FC   (0x0004)  
	int32_t                                            MaxParticleCount;                                           // 0x0200   (0x0004)  
	TEnumAsByte<EParticleScreenAlignment>              ScreenAlignment;                                            // 0x0204   (0x0001)  
	TEnumAsByte<EParticleAxisLock>                     LockAxisFlag;                                               // 0x0205   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x0206   (0x0002)  MISSED
	bool                                               bEnableCollision : 1;                                       // 0x0208:0 (0x0001)  
	unsigned char                                      UnknownData03_4[0x3];                                       // 0x0209   (0x0003)  MISSED
	TEnumAsByte<EParticleCollisionMode>                CollisionMode;                                              // 0x020C   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x020D   (0x0003)  MISSED
	bool                                               bRemoveHMDRoll : 1;                                         // 0x0210:0 (0x0001)  
	unsigned char                                      UnknownData05_4[0x3];                                       // 0x0211   (0x0003)  MISSED
	float                                              MinFacingCameraBlendDistance;                               // 0x0214   (0x0004)  
	float                                              MaxFacingCameraBlendDistance;                               // 0x0218   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x021C   (0x0004)  MISSED
	FRawDistributionVector                             DynamicColor;                                               // 0x0220   (0x0060)  
	FRawDistributionFloat                              DynamicAlpha;                                               // 0x0280   (0x0030)  
	FRawDistributionVector                             DynamicColorScale;                                          // 0x02B0   (0x0060)  
